<abi-corpus version='2.2' path='/src/build/lib64/libopenassetio-c.so.1.0.0' architecture='elf-amd-x86_64' soname='libopenassetio-c.so.1.0'>
  <elf-needed>
    <dependency name='libopenassetio.so.1.0'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_ZN11openassetio2v110managerApi24CManagerInterfaceAdapter10initializeESt13unordered_mapISsSt7variantIJbldSsEESt4hashISsESt8equal_toISsESaISt4pairIKSsS5_EEERKSt10shared_ptrINS1_11HostSessionEE' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN11openassetio2v110managerApi24CManagerInterfaceAdapter12entityExistsERKSt6vectorINS0_15EntityReferenceESaIS4_EERKSt10shared_ptrIKNS0_7ContextEERKS9_INS1_11HostSessionEERKSt8functionIFvmbEERKSJ_IFvmNS0_6errors17BatchElementErrorEEE' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN11openassetio2v110managerApi24CManagerInterfaceAdapter13hasCapabilityENS1_16ManagerInterface10CapabilityE' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='openassetio_v1_InfoDictionary_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='openassetio_v1_InfoDictionary_typeOf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='openassetio_v1_hostApi_Manager_ctor' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='openassetio_v1_hostApi_Manager_displayName' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='openassetio_v1_hostApi_Manager_identifier' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='openassetio_v1_hostApi_Manager_info' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='_ZNSt8__detail9__variant12__gen_vtableILb1ENS0_16__variant_cookieEOZNS0_16_Variant_storageILb0EJbldSsEE13_M_reset_implEvEUlOT_E_JRSt7variantIJbldSsEEEE9_S_vtableE' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZSt19piecewise_construct' size='1' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN11openassetio2v110managerApi24CManagerInterfaceAdapterE' size='40' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN11openassetio2v16errors20OpenAssetIOExceptionE' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN11openassetio2v16errors23NotImplementedExceptionE' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTISt18bad_variant_access' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN11openassetio2v110managerApi24CManagerInterfaceAdapterE' size='57' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN11openassetio2v16errors20OpenAssetIOExceptionE' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN11openassetio2v16errors23NotImplementedExceptionE' size='51' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSSt18bad_variant_access' size='23' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTVN11openassetio2v110managerApi24CManagerInterfaceAdapterE' size='208' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='/src/src/openassetio-core-c/src/InfoDictionary.cpp' comp-dir-path='/src/build/src/openassetio-core-c' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-2'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-3'/>
    <qualified-type-def type-id='type-id-4' const='yes' id='type-id-5'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-6'/>
    <function-decl name='setlocale' filepath='/usr/include/locale.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='localeconv' filepath='/usr/include/locale.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='remove' filepath='/usr/include/stdio.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='rename' filepath='/usr/include/stdio.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='tmpfile' filepath='/usr/include/stdio.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='tmpnam' filepath='/usr/include/stdio.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fflush' filepath='/usr/include/stdio.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fopen' filepath='/usr/include/stdio.h' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='freopen' filepath='/usr/include/stdio.h' line='278' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='setbuf' filepath='/usr/include/stdio.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='setvbuf' filepath='/usr/include/stdio.h' line='336' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fgetc' filepath='/usr/include/stdio.h' line='531' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='getc' filepath='/usr/include/stdio.h' line='532' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='getchar' filepath='/usr/include/stdio.h' line='538' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fgets' filepath='/usr/include/stdio.h' line='622' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='ungetc' filepath='/usr/include/stdio.h' line='702' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fread' filepath='/usr/include/stdio.h' line='709' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='fseek' filepath='/usr/include/stdio.h' line='749' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='ftell' filepath='/usr/include/stdio.h' line='754' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='rewind' filepath='/usr/include/stdio.h' line='759' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='fgetpos' filepath='/usr/include/stdio.h' line='798' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fsetpos' filepath='/usr/include/stdio.h' line='803' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='clearerr' filepath='/usr/include/stdio.h' line='826' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='feof' filepath='/usr/include/stdio.h' line='828' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='ferror' filepath='/usr/include/stdio.h' line='830' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='perror' filepath='/usr/include/stdio.h' line='846' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='atof' filepath='/usr/include/stdlib.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='atoi' filepath='/usr/include/stdlib.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='atol' filepath='/usr/include/stdlib.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='atoll' filepath='/usr/include/stdlib.h' line='157' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='strtod' filepath='/usr/include/stdlib.h' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='strtof' filepath='/usr/include/stdlib.h' line='172' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='strtold' filepath='/usr/include/stdlib.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='strtol' filepath='/usr/include/stdlib.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='strtoul' filepath='/usr/include/stdlib.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='strtoll' filepath='/usr/include/stdlib.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='strtoull' filepath='/usr/include/stdlib.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='rand' filepath='/usr/include/stdlib.h' line='374' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='srand' filepath='/usr/include/stdlib.h' line='376' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='atexit' filepath='/usr/include/stdlib.h' line='518' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='quick_exit' filepath='/usr/include/stdlib.h' line='548' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='563' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='system' filepath='/usr/include/stdlib.h' line='716' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='bsearch' filepath='/usr/include/stdlib.h' line='754' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='qsort' filepath='/usr/include/stdlib.h' line='760' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='div' filepath='/usr/include/stdlib.h' line='784' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='ldiv' filepath='/usr/include/stdlib.h' line='786' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='lldiv' filepath='/usr/include/stdlib.h' line='792' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='mblen' filepath='/usr/include/stdlib.h' line='859' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='mbtowc' filepath='/usr/include/stdlib.h' line='862' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='wctomb' filepath='/usr/include/stdlib.h' line='866' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='mbstowcs' filepath='/usr/include/stdlib.h' line='870' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='wcstombs' filepath='/usr/include/stdlib.h' line='873' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='strcoll' filepath='/usr/include/string.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='strxfrm' filepath='/usr/include/string.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='strtok' filepath='/usr/include/string.h' line='344' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='strerror' filepath='/usr/include/string.h' line='409' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='wcscpy' filepath='/usr/include/wchar.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='wcsncpy' filepath='/usr/include/wchar.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='wcscat' filepath='/usr/include/wchar.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='wcsncat' filepath='/usr/include/wchar.h' line='158' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='wcscmp' filepath='/usr/include/wchar.h' line='163' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='wcsncmp' filepath='/usr/include/wchar.h' line='166' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='wcscoll' filepath='/usr/include/wchar.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='wcsxfrm' filepath='/usr/include/wchar.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='wcscspn' filepath='/usr/include/wchar.h' line='252' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='wcsspn' filepath='/usr/include/wchar.h' line='256' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='wcstok' filepath='/usr/include/wchar.h' line='282' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='wcslen' filepath='/usr/include/wchar.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='wmemcmp' filepath='/usr/include/wchar.h' line='325' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='wmemcpy' filepath='/usr/include/wchar.h' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='wmemmove' filepath='/usr/include/wchar.h' line='334' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='wmemset' filepath='/usr/include/wchar.h' line='338' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='btowc' filepath='/usr/include/wchar.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='wctob' filepath='/usr/include/wchar.h' line='357' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='mbsinit' filepath='/usr/include/wchar.h' line='361' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-36'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='mbrtowc' filepath='/usr/include/wchar.h' line='365' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='wcrtomb' filepath='/usr/include/wchar.h' line='370' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='mbrlen' filepath='/usr/include/wchar.h' line='376' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='mbsrtowcs' filepath='/usr/include/wchar.h' line='408' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='wcsrtombs' filepath='/usr/include/wchar.h' line='414' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='wcstod' filepath='/usr/include/wchar.h' line='450' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='wcstof' filepath='/usr/include/wchar.h' line='457' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='wcstold' filepath='/usr/include/wchar.h' line='459' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='wcstol' filepath='/usr/include/wchar.h' line='468' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='wcstoul' filepath='/usr/include/wchar.h' line='473' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='wcstoll' filepath='/usr/include/wchar.h' line='483' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='wcstoull' filepath='/usr/include/wchar.h' line='490' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='fwide' filepath='/usr/include/wchar.h' line='587' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fwprintf' filepath='/usr/include/wchar.h' line='594' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-33'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='wprintf' filepath='/usr/include/wchar.h' line='601' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='swprintf' filepath='/usr/include/wchar.h' line='604' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-33'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='vfwprintf' filepath='/usr/include/wchar.h' line='612' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='vwprintf' filepath='/usr/include/wchar.h' line='620' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='vswprintf' filepath='/usr/include/wchar.h' line='625' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fwscanf' filepath='/usr/include/wchar.h' line='635' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-33'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='wscanf' filepath='/usr/include/wchar.h' line='642' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='swscanf' filepath='/usr/include/wchar.h' line='645' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='vfwscanf' filepath='/usr/include/wchar.h' line='689' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='vwscanf' filepath='/usr/include/wchar.h' line='697' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='vswscanf' filepath='/usr/include/wchar.h' line='701' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fgetwc' filepath='/usr/include/wchar.h' line='745' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='getwc' filepath='/usr/include/wchar.h' line='746' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='getwchar' filepath='/usr/include/wchar.h' line='752' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='fputwc' filepath='/usr/include/wchar.h' line='759' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='putwc' filepath='/usr/include/wchar.h' line='760' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='putwchar' filepath='/usr/include/wchar.h' line='766' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='fgetws' filepath='/usr/include/wchar.h' line='774' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='fputws' filepath='/usr/include/wchar.h' line='781' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='ungetwc' filepath='/usr/include/wchar.h' line='789' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='wcsftime' filepath='/usr/include/wchar.h' line='855' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-42'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='/src/src/openassetio-core-c/src/hostApi/Manager.cpp' comp-dir-path='/src/build/src/openassetio-core-c' language='LANG_C_plus_plus'>
    <type-decl name='char16_t' size-in-bits='16' id='type-id-43'/>
    <type-decl name='char32_t' size-in-bits='32' id='type-id-44'/>
    <array-type-def dimensions='1' type-id='type-id-45' size-in-bits='8' id='type-id-46'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-23' id='type-id-47'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-45' size-in-bits='160' id='type-id-48'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='type-id-23' id='type-id-49'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-45' size-in-bits='32' id='type-id-50'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-23' id='type-id-51'/>
    </array-type-def>
    <type-decl name='long double' size-in-bits='128' id='type-id-22'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-52'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-53'/>
    <class-decl name='_G_fpos_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-54' visibility='default' filepath='/usr/include/_G_config.h' line='22' column='1' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__pos' type-id='type-id-56' visibility='default' filepath='/usr/include/_G_config.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__state' type-id='type-id-57' visibility='default' filepath='/usr/include/_G_config.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/libio.h' line='246' column='1' id='type-id-58'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-7' visibility='default' filepath='/usr/include/libio.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-9' visibility='default' filepath='/usr/include/libio.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-9' visibility='default' filepath='/usr/include/libio.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-9' visibility='default' filepath='/usr/include/libio.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-9' visibility='default' filepath='/usr/include/libio.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-9' visibility='default' filepath='/usr/include/libio.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-9' visibility='default' filepath='/usr/include/libio.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-9' visibility='default' filepath='/usr/include/libio.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-9' visibility='default' filepath='/usr/include/libio.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-9' visibility='default' filepath='/usr/include/libio.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-9' visibility='default' filepath='/usr/include/libio.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-9' visibility='default' filepath='/usr/include/libio.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-59' visibility='default' filepath='/usr/include/libio.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-60' visibility='default' filepath='/usr/include/libio.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-7' visibility='default' filepath='/usr/include/libio.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-7' visibility='default' filepath='/usr/include/libio.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-56' visibility='default' filepath='/usr/include/libio.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-61' visibility='default' filepath='/usr/include/libio.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-53' visibility='default' filepath='/usr/include/libio.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-46' visibility='default' filepath='/usr/include/libio.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-62' visibility='default' filepath='/usr/include/libio.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-63' visibility='default' filepath='/usr/include/libio.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='__pad1' type-id='type-id-14' visibility='default' filepath='/usr/include/libio.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='__pad2' type-id='type-id-14' visibility='default' filepath='/usr/include/libio.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='__pad3' type-id='type-id-14' visibility='default' filepath='/usr/include/libio.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='__pad4' type-id='type-id-14' visibility='default' filepath='/usr/include/libio.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-13' visibility='default' filepath='/usr/include/libio.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-7' visibility='default' filepath='/usr/include/libio.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-48' visibility='default' filepath='/usr/include/libio.h' line='311' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/libio.h' line='161' column='1' id='type-id-64'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_next' type-id='type-id-59' visibility='default' filepath='/usr/include/libio.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_sbuf' type-id='type-id-60' visibility='default' filepath='/usr/include/libio.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_pos' type-id='type-id-7' visibility='default' filepath='/usr/include/libio.h' line='167' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__mbstate_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-57' visibility='default' filepath='/usr/include/wchar.h' line='83' column='1' id='type-id-65'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/wchar.h' line='86' column='1' id='type-id-66'>
          <data-member access='public'>
            <var-decl name='__wch' type-id='type-id-25' visibility='default' filepath='/usr/include/wchar.h' line='88' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='__wchb' type-id='type-id-50' visibility='default' filepath='/usr/include/wchar.h' line='92' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-7' visibility='default' filepath='/usr/include/wchar.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-66' visibility='default' filepath='/usr/include/wchar.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='div_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-28' visibility='default' filepath='/usr/include/stdlib.h' line='98' column='1' id='type-id-67'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-7' visibility='default' filepath='/usr/include/stdlib.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rem' type-id='type-id-7' visibility='default' filepath='/usr/include/stdlib.h' line='100' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='lconv' size-in-bits='768' is-struct='yes' visibility='default' filepath='/usr/include/locale.h' line='54' column='1' id='type-id-68'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='decimal_point' type-id='type-id-9' visibility='default' filepath='/usr/include/locale.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thousands_sep' type-id='type-id-9' visibility='default' filepath='/usr/include/locale.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='grouping' type-id='type-id-9' visibility='default' filepath='/usr/include/locale.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='int_curr_symbol' type-id='type-id-9' visibility='default' filepath='/usr/include/locale.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='currency_symbol' type-id='type-id-9' visibility='default' filepath='/usr/include/locale.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mon_decimal_point' type-id='type-id-9' visibility='default' filepath='/usr/include/locale.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mon_thousands_sep' type-id='type-id-9' visibility='default' filepath='/usr/include/locale.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mon_grouping' type-id='type-id-9' visibility='default' filepath='/usr/include/locale.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='positive_sign' type-id='type-id-9' visibility='default' filepath='/usr/include/locale.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='negative_sign' type-id='type-id-9' visibility='default' filepath='/usr/include/locale.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='int_frac_digits' type-id='type-id-45' visibility='default' filepath='/usr/include/locale.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='frac_digits' type-id='type-id-45' visibility='default' filepath='/usr/include/locale.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='p_cs_precedes' type-id='type-id-45' visibility='default' filepath='/usr/include/locale.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='664'>
        <var-decl name='p_sep_by_space' type-id='type-id-45' visibility='default' filepath='/usr/include/locale.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='n_cs_precedes' type-id='type-id-45' visibility='default' filepath='/usr/include/locale.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='680'>
        <var-decl name='n_sep_by_space' type-id='type-id-45' visibility='default' filepath='/usr/include/locale.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='688'>
        <var-decl name='p_sign_posn' type-id='type-id-45' visibility='default' filepath='/usr/include/locale.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='696'>
        <var-decl name='n_sign_posn' type-id='type-id-45' visibility='default' filepath='/usr/include/locale.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='int_p_cs_precedes' type-id='type-id-45' visibility='default' filepath='/usr/include/locale.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='712'>
        <var-decl name='int_p_sep_by_space' type-id='type-id-45' visibility='default' filepath='/usr/include/locale.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='720'>
        <var-decl name='int_n_cs_precedes' type-id='type-id-45' visibility='default' filepath='/usr/include/locale.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='728'>
        <var-decl name='int_n_sep_by_space' type-id='type-id-45' visibility='default' filepath='/usr/include/locale.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='int_p_sign_posn' type-id='type-id-45' visibility='default' filepath='/usr/include/locale.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='744'>
        <var-decl name='int_n_sign_posn' type-id='type-id-45' visibility='default' filepath='/usr/include/locale.h' line='112' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-29' visibility='default' filepath='/usr/include/stdlib.h' line='106' column='1' id='type-id-69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-15' visibility='default' filepath='/usr/include/stdlib.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-15' visibility='default' filepath='/usr/include/stdlib.h' line='108' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/time.h' line='133' column='1' id='type-id-70'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-7' visibility='default' filepath='/usr/include/time.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-7' visibility='default' filepath='/usr/include/time.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-7' visibility='default' filepath='/usr/include/time.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-7' visibility='default' filepath='/usr/include/time.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-7' visibility='default' filepath='/usr/include/time.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-7' visibility='default' filepath='/usr/include/time.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-7' visibility='default' filepath='/usr/include/time.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-7' visibility='default' filepath='/usr/include/time.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-7' visibility='default' filepath='/usr/include/time.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-15' visibility='default' filepath='/usr/include/time.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='147' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-58' filepath='/usr/include/stdio.h' line='48' column='1' id='type-id-71'/>
    <typedef-decl name='_G_fpos_t' type-id='type-id-55' filepath='/usr/include/_G_config.h' line='25' column='1' id='type-id-54'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-12' filepath='/usr/include/libio.h' line='155' column='1' id='type-id-72'/>
    <typedef-decl name='__FILE' type-id='type-id-58' filepath='/usr/include/stdio.h' line='64' column='1' id='type-id-73'/>
    <typedef-decl name='__compar_fn_t' type-id='type-id-74' filepath='/usr/include/stdlib.h' line='741' column='1' id='type-id-27'/>
    <typedef-decl name='__mbstate_t' type-id='type-id-65' filepath='/usr/include/wchar.h' line='94' column='1' id='type-id-57'/>
    <typedef-decl name='__off64_t' type-id='type-id-15' filepath='/usr/include/bits/types.h' line='141' column='1' id='type-id-63'/>
    <typedef-decl name='__off_t' type-id='type-id-15' filepath='/usr/include/bits/types.h' line='140' column='1' id='type-id-56'/>
    <typedef-decl name='div_t' type-id='type-id-67' filepath='/usr/include/stdlib.h' line='101' column='1' id='type-id-28'/>
    <typedef-decl name='fpos_t' type-id='type-id-54' filepath='/usr/include/stdio.h' line='110' column='1' id='type-id-75'/>
    <typedef-decl name='ldiv_t' type-id='type-id-69' filepath='/usr/include/stdlib.h' line='109' column='1' id='type-id-29'/>
    <typedef-decl name='mbstate_t' type-id='type-id-57' filepath='/usr/include/wchar.h' line='106' column='1' id='type-id-76'/>
    <typedef-decl name='uint_least16_t' type-id='type-id-61' filepath='/usr/include/stdint.h' line='77' column='1' id='type-id-77'/>
    <typedef-decl name='uint_least32_t' type-id='type-id-25' filepath='/usr/include/stdint.h' line='78' column='1' id='type-id-78'/>
    <typedef-decl name='wint_t' type-id='type-id-25' filepath='/opt/rh/devtoolset-9/root/usr/lib/gcc/x86_64-redhat-linux/9/include/stddef.h' line='350' column='1' id='type-id-35'/>
    <type-decl name='unsigned long long int' size-in-bits='64' id='type-id-24'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-61'/>
    <type-decl name='wchar_t' size-in-bits='32' id='type-id-32'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-11'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-59'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-40'/>
    <reference-type-def kind='lvalue' type-id='type-id-79' size-in-bits='64' id='type-id-80'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-81'/>
    <reference-type-def kind='lvalue' type-id='type-id-82' size-in-bits='64' id='type-id-83'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-84'/>
    <reference-type-def kind='lvalue' type-id='type-id-85' size-in-bits='64' id='type-id-86'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-87'/>
    <reference-type-def kind='lvalue' type-id='type-id-88' size-in-bits='64' id='type-id-89'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-90'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-92'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-94'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-20'/>
    <reference-type-def kind='lvalue' type-id='type-id-43' size-in-bits='64' id='type-id-95'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-96'/>
    <qualified-type-def type-id='type-id-96' const='yes' id='type-id-97'/>
    <reference-type-def kind='lvalue' type-id='type-id-97' size-in-bits='64' id='type-id-98'/>
    <reference-type-def kind='lvalue' type-id='type-id-44' size-in-bits='64' id='type-id-99'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-100'/>
    <qualified-type-def type-id='type-id-100' const='yes' id='type-id-101'/>
    <reference-type-def kind='lvalue' type-id='type-id-101' size-in-bits='64' id='type-id-102'/>
    <qualified-type-def type-id='type-id-79' const='yes' id='type-id-103'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-104'/>
    <qualified-type-def type-id='type-id-82' const='yes' id='type-id-105'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-106'/>
    <qualified-type-def type-id='type-id-85' const='yes' id='type-id-107'/>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-108'/>
    <qualified-type-def type-id='type-id-88' const='yes' id='type-id-109'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-110'/>
    <qualified-type-def type-id='type-id-91' const='yes' id='type-id-111'/>
    <reference-type-def kind='lvalue' type-id='type-id-111' size-in-bits='64' id='type-id-112'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-113'/>
    <qualified-type-def type-id='type-id-93' const='yes' id='type-id-114'/>
    <reference-type-def kind='lvalue' type-id='type-id-114' size-in-bits='64' id='type-id-115'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-116'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-38'/>
    <qualified-type-def type-id='type-id-43' const='yes' id='type-id-117'/>
    <reference-type-def kind='lvalue' type-id='type-id-117' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-119'/>
    <qualified-type-def type-id='type-id-119' const='yes' id='type-id-120'/>
    <reference-type-def kind='lvalue' type-id='type-id-120' size-in-bits='64' id='type-id-121'/>
    <qualified-type-def type-id='type-id-44' const='yes' id='type-id-122'/>
    <reference-type-def kind='lvalue' type-id='type-id-122' size-in-bits='64' id='type-id-123'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-124'/>
    <qualified-type-def type-id='type-id-124' const='yes' id='type-id-125'/>
    <reference-type-def kind='lvalue' type-id='type-id-125' size-in-bits='64' id='type-id-126'/>
    <qualified-type-def type-id='type-id-75' const='yes' id='type-id-127'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-17'/>
    <qualified-type-def type-id='type-id-76' const='yes' id='type-id-128'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-36'/>
    <qualified-type-def type-id='type-id-129' const='yes' id='type-id-130'/>
    <qualified-type-def type-id='type-id-131' const='yes' id='type-id-132'/>
    <qualified-type-def type-id='type-id-133' const='yes' id='type-id-134'/>
    <qualified-type-def type-id='type-id-135' const='yes' id='type-id-136'/>
    <reference-type-def kind='lvalue' type-id='type-id-136' size-in-bits='64' id='type-id-137'/>
    <qualified-type-def type-id='type-id-138' const='yes' id='type-id-139'/>
    <reference-type-def kind='lvalue' type-id='type-id-139' size-in-bits='64' id='type-id-140'/>
    <qualified-type-def type-id='type-id-141' const='yes' id='type-id-142'/>
    <qualified-type-def type-id='type-id-143' const='yes' id='type-id-144'/>
    <reference-type-def kind='lvalue' type-id='type-id-144' size-in-bits='64' id='type-id-145'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-146'/>
    <qualified-type-def type-id='type-id-147' const='yes' id='type-id-148'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-149'/>
    <qualified-type-def type-id='type-id-150' const='yes' id='type-id-151'/>
    <reference-type-def kind='lvalue' type-id='type-id-151' size-in-bits='64' id='type-id-152'/>
    <qualified-type-def type-id='type-id-153' const='yes' id='type-id-154'/>
    <reference-type-def kind='lvalue' type-id='type-id-154' size-in-bits='64' id='type-id-155'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-156'/>
    <qualified-type-def type-id='type-id-157' const='yes' id='type-id-158'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-159'/>
    <qualified-type-def type-id='type-id-160' const='yes' id='type-id-161'/>
    <reference-type-def kind='lvalue' type-id='type-id-161' size-in-bits='64' id='type-id-162'/>
    <qualified-type-def type-id='type-id-163' const='yes' id='type-id-164'/>
    <reference-type-def kind='lvalue' type-id='type-id-164' size-in-bits='64' id='type-id-165'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-166'/>
    <qualified-type-def type-id='type-id-167' const='yes' id='type-id-168'/>
    <reference-type-def kind='lvalue' type-id='type-id-168' size-in-bits='64' id='type-id-169'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-170'/>
    <qualified-type-def type-id='type-id-171' const='yes' id='type-id-172'/>
    <reference-type-def kind='lvalue' type-id='type-id-172' size-in-bits='64' id='type-id-173'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-174'/>
    <qualified-type-def type-id='type-id-175' const='yes' id='type-id-176'/>
    <reference-type-def kind='lvalue' type-id='type-id-176' size-in-bits='64' id='type-id-177'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-178'/>
    <qualified-type-def type-id='type-id-179' const='yes' id='type-id-180'/>
    <reference-type-def kind='lvalue' type-id='type-id-180' size-in-bits='64' id='type-id-181'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-182'/>
    <qualified-type-def type-id='type-id-183' const='yes' id='type-id-184'/>
    <reference-type-def kind='lvalue' type-id='type-id-184' size-in-bits='64' id='type-id-185'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-186'/>
    <qualified-type-def type-id='type-id-187' const='yes' id='type-id-188'/>
    <reference-type-def kind='lvalue' type-id='type-id-188' size-in-bits='64' id='type-id-189'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-190'/>
    <qualified-type-def type-id='type-id-191' const='yes' id='type-id-192'/>
    <reference-type-def kind='lvalue' type-id='type-id-192' size-in-bits='64' id='type-id-193'/>
    <qualified-type-def type-id='type-id-194' const='yes' id='type-id-195'/>
    <reference-type-def kind='lvalue' type-id='type-id-195' size-in-bits='64' id='type-id-196'/>
    <pointer-type-def type-id='type-id-195' size-in-bits='64' id='type-id-197'/>
    <qualified-type-def type-id='type-id-198' const='yes' id='type-id-199'/>
    <reference-type-def kind='lvalue' type-id='type-id-199' size-in-bits='64' id='type-id-200'/>
    <qualified-type-def type-id='type-id-201' const='yes' id='type-id-202'/>
    <qualified-type-def type-id='type-id-203' const='yes' id='type-id-204'/>
    <qualified-type-def type-id='type-id-205' const='yes' id='type-id-206'/>
    <qualified-type-def type-id='type-id-207' const='yes' id='type-id-208'/>
    <qualified-type-def type-id='type-id-209' const='yes' id='type-id-210'/>
    <qualified-type-def type-id='type-id-211' const='yes' id='type-id-212'/>
    <qualified-type-def type-id='type-id-213' const='yes' id='type-id-214'/>
    <qualified-type-def type-id='type-id-215' const='yes' id='type-id-216'/>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-217'/>
    <qualified-type-def type-id='type-id-218' const='yes' id='type-id-219'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-220'/>
    <qualified-type-def type-id='type-id-221' const='yes' id='type-id-222'/>
    <pointer-type-def type-id='type-id-222' size-in-bits='64' id='type-id-223'/>
    <qualified-type-def type-id='type-id-224' const='yes' id='type-id-225'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-226'/>
    <qualified-type-def type-id='type-id-227' const='yes' id='type-id-228'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-229'/>
    <qualified-type-def type-id='type-id-230' const='yes' id='type-id-231'/>
    <pointer-type-def type-id='type-id-231' size-in-bits='64' id='type-id-232'/>
    <qualified-type-def type-id='type-id-233' const='yes' id='type-id-234'/>
    <pointer-type-def type-id='type-id-234' size-in-bits='64' id='type-id-235'/>
    <qualified-type-def type-id='type-id-236' const='yes' id='type-id-237'/>
    <pointer-type-def type-id='type-id-237' size-in-bits='64' id='type-id-238'/>
    <qualified-type-def type-id='type-id-239' const='yes' id='type-id-240'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-241'/>
    <qualified-type-def type-id='type-id-242' const='yes' id='type-id-243'/>
    <qualified-type-def type-id='type-id-70' const='yes' id='type-id-244'/>
    <pointer-type-def type-id='type-id-244' size-in-bits='64' id='type-id-42'/>
    <qualified-type-def type-id='type-id-25' const='yes' id='type-id-245'/>
    <qualified-type-def type-id='type-id-24' const='yes' id='type-id-246'/>
    <qualified-type-def type-id='type-id-32' const='yes' id='type-id-247'/>
    <pointer-type-def type-id='type-id-247' size-in-bits='64' id='type-id-33'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-39'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-16'/>
    <pointer-type-def type-id='type-id-248' size-in-bits='64' id='type-id-74'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-10'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-37'/>
    <reference-type-def kind='lvalue' type-id='type-id-135' size-in-bits='64' id='type-id-249'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-250'/>
    <reference-type-def kind='lvalue' type-id='type-id-138' size-in-bits='64' id='type-id-251'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-252'/>
    <reference-type-def kind='lvalue' type-id='type-id-143' size-in-bits='64' id='type-id-253'/>
    <reference-type-def kind='rvalue' type-id='type-id-143' size-in-bits='64' id='type-id-254'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-255'/>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-257'/>
    <reference-type-def kind='lvalue' type-id='type-id-147' size-in-bits='64' id='type-id-258'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-259'/>
    <pointer-type-def type-id='type-id-260' size-in-bits='64' id='type-id-261'/>
    <reference-type-def kind='lvalue' type-id='type-id-150' size-in-bits='64' id='type-id-262'/>
    <reference-type-def kind='lvalue' type-id='type-id-153' size-in-bits='64' id='type-id-263'/>
    <reference-type-def kind='rvalue' type-id='type-id-153' size-in-bits='64' id='type-id-264'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-265'/>
    <pointer-type-def type-id='type-id-266' size-in-bits='64' id='type-id-267'/>
    <reference-type-def kind='lvalue' type-id='type-id-157' size-in-bits='64' id='type-id-268'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-269'/>
    <pointer-type-def type-id='type-id-270' size-in-bits='64' id='type-id-271'/>
    <reference-type-def kind='lvalue' type-id='type-id-160' size-in-bits='64' id='type-id-272'/>
    <reference-type-def kind='lvalue' type-id='type-id-163' size-in-bits='64' id='type-id-273'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-274'/>
    <reference-type-def kind='lvalue' type-id='type-id-171' size-in-bits='64' id='type-id-275'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-276'/>
    <reference-type-def kind='lvalue' type-id='type-id-179' size-in-bits='64' id='type-id-277'/>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-278'/>
    <reference-type-def kind='lvalue' type-id='type-id-187' size-in-bits='64' id='type-id-279'/>
    <pointer-type-def type-id='type-id-187' size-in-bits='64' id='type-id-280'/>
    <reference-type-def kind='lvalue' type-id='type-id-194' size-in-bits='64' id='type-id-281'/>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-282'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-283'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-284'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-285'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-286'/>
    <pointer-type-def type-id='type-id-287' size-in-bits='64' id='type-id-26'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-34'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-62'/>
    <function-type size-in-bits='64' id='type-id-248'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-287'>
      <return type-id='type-id-12'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='/src/src/openassetio-core-c/src/managerApi/CManagerInterfaceAdapter.cpp' comp-dir-path='/src/build/src/openassetio-core-c' language='LANG_C_plus_plus'>
    <function-type size-in-bits='64' id='type-id-288'>
      <parameter type-id='type-id-289'/>
      <parameter type-id='type-id-290'/>
      <return type-id='type-id-291'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-b' comp-dir-path='/src/build/src/openassetio-core-c' language='LANG_C_plus_plus'>
    <type-decl name='bool' size-in-bits='8' id='type-id-292'/>
    <type-decl name='char' size-in-bits='8' id='type-id-45'/>
    <type-decl name='double' size-in-bits='64' id='type-id-18'/>
    <enum-decl name='openassetio_v1_ErrorCode' naming-typedef-id='type-id-293' linkage-name='24openassetio_v1_ErrorCode' filepath='/src/src/openassetio-core-c/include/openassetio/c/managerApi/.././errors.h' line='42' column='1' id='type-id-294'>
      <underlying-type type-id='type-id-295'/>
      <enumerator name='openassetio_v1_ErrorCode_kOK' value='0'/>
      <enumerator name='openassetio_v1_ErrorCode_kUnknown' value='1'/>
      <enumerator name='openassetio_v1_ErrorCode_kException' value='2'/>
      <enumerator name='openassetio_v1_ErrorCode_kBadVariantAccess' value='3'/>
      <enumerator name='openassetio_v1_ErrorCode_kOutOfRange' value='4'/>
      <enumerator name='openassetio_v1_ErrorCode_kLengthError' value='5'/>
    </enum-decl>
    <enum-decl name='openassetio_v1_InfoDictionary_ValueType' naming-typedef-id='type-id-296' linkage-name='39openassetio_v1_InfoDictionary_ValueType' filepath='/src/src/openassetio-core-c/include/openassetio/c/InfoDictionary.h' line='79' column='1' id='type-id-297'>
      <underlying-type type-id='type-id-295'/>
      <enumerator name='openassetio_v1_InfoDictionary_ValueType_kBool' value='1'/>
      <enumerator name='openassetio_v1_InfoDictionary_ValueType_kInt' value='2'/>
      <enumerator name='openassetio_v1_InfoDictionary_ValueType_kFloat' value='3'/>
      <enumerator name='openassetio_v1_InfoDictionary_ValueType_kStr' value='4'/>
    </enum-decl>
    <type-decl name='float' size-in-bits='32' id='type-id-21'/>
    <type-decl name='int' size-in-bits='32' id='type-id-7'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-15'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-19'/>
    <array-type-def dimensions='1' type-id='type-id-298' size-in-bits='256' id='type-id-299'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-23' id='type-id-51'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-300' size-in-bits='256' id='type-id-301'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-23' id='type-id-51'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-302' size-in-bits='unknown' id='type-id-303'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' id='type-id-304'/>
    </array-type-def>
    <class-decl name='&lt;lambda()&gt;' size-in-bits='192' is-struct='yes' visibility='default' filepath='/src/src/openassetio-core-c/src/InfoDictionary.cpp' line='135' column='1' id='type-id-305'>
      <member-type access='public'>
        <class-decl name='&lt;lambda(auto:22&amp;&amp;)&gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='/src/src/openassetio-core-c/src/InfoDictionary.cpp' line='139' column='1' id='type-id-306'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='__out' type-id='type-id-307' visibility='default' filepath='/src/src/openassetio-core-c/src/InfoDictionary.cpp' line='139' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__handle' type-id='type-id-308' visibility='default' filepath='/src/src/openassetio-core-c/src/InfoDictionary.cpp' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__out' type-id='type-id-307' visibility='default' filepath='/src/src/openassetio-core-c/src/InfoDictionary.cpp' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__key' type-id='type-id-309' visibility='default' filepath='/src/src/openassetio-core-c/src/InfoDictionary.cpp' line='153' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='lldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-30' visibility='default' filepath='/usr/include/stdlib.h' line='118' column='1' id='type-id-310'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-19' visibility='default' filepath='/usr/include/stdlib.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-19' visibility='default' filepath='/usr/include/stdlib.h' line='120' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='openassetio_v1_ConstStringView' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-311' visibility='default' filepath='/src/src/openassetio-core-c/include/openassetio/c/./StringView.h' line='58' column='1' id='type-id-312'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-313' visibility='default' filepath='/src/src/openassetio-core-c/include/openassetio/c/./StringView.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-314' visibility='default' filepath='/src/src/openassetio-core-c/include/openassetio/c/./StringView.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='openassetio_v1_StringView' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-315' visibility='default' filepath='/src/src/openassetio-core-c/include/openassetio/c/./StringView.h' line='116' column='1' id='type-id-316'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='capacity' type-id='type-id-314' visibility='default' filepath='/src/src/openassetio-core-c/include/openassetio/c/./StringView.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-317' visibility='default' filepath='/src/src/openassetio-core-c/include/openassetio/c/./StringView.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-13' visibility='default' filepath='/src/src/openassetio-core-c/include/openassetio/c/./StringView.h' line='122' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='openassetio_v1_managerApi_CManagerInterface_s' size-in-bits='256' is-struct='yes' naming-typedef-id='type-id-318' visibility='default' filepath='/src/src/openassetio-core-c/include/openassetio/c/managerApi/CManagerInterface.h' line='72' column='1' id='type-id-319'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dtor' type-id='type-id-320' visibility='default' filepath='/src/src/openassetio-core-c/include/openassetio/c/managerApi/CManagerInterface.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='identifier' type-id='type-id-321' visibility='default' filepath='/src/src/openassetio-core-c/include/openassetio/c/managerApi/CManagerInterface.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='displayName' type-id='type-id-321' visibility='default' filepath='/src/src/openassetio-core-c/include/openassetio/c/managerApi/CManagerInterface.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='info' type-id='type-id-322' visibility='default' filepath='/src/src/openassetio-core-c/include/openassetio/c/managerApi/CManagerInterface.h' line='133' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='typedef __va_list_tag __va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-323'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-25' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-25' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-14' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_Atomic_word' type-id='type-id-7' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/x86_64-redhat-linux/bits/atomic_word.h' line='32' column='1' id='type-id-324'/>
    <typedef-decl name='int64_t' type-id='type-id-15' filepath='/usr/include/stdint.h' line='40' column='1' id='type-id-325'/>
    <typedef-decl name='lldiv_t' type-id='type-id-310' filepath='/usr/include/stdlib.h' line='121' column='1' id='type-id-30'/>
    <typedef-decl name='openassetio_v1_ConstStringView' type-id='type-id-312' filepath='/src/src/openassetio-core-c/include/openassetio/c/./StringView.h' line='63' column='1' id='type-id-311'/>
    <typedef-decl name='openassetio_v1_ErrorCode' type-id='type-id-294' filepath='/src/src/openassetio-core-c/include/openassetio/c/managerApi/.././errors.h' line='55' column='1' id='type-id-293'/>
    <typedef-decl name='openassetio_v1_InfoDictionary_ValueType' type-id='type-id-297' filepath='/src/src/openassetio-core-c/include/openassetio/c/InfoDictionary.h' line='88' column='1' id='type-id-296'/>
    <typedef-decl name='openassetio_v1_StringView' type-id='type-id-316' filepath='/src/src/openassetio-core-c/include/openassetio/c/./StringView.h' line='123' column='1' id='type-id-315'/>
    <typedef-decl name='openassetio_v1_managerApi_CManagerInterface_s' type-id='type-id-319' filepath='/src/src/openassetio-core-c/include/openassetio/c/managerApi/CManagerInterface.h' line='135' column='1' id='type-id-318'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-295'/>
    <type-decl name='unnamed-enum-underlying-type-64' is-anonymous='yes' size-in-bits='64' alignment-in-bits='64' id='type-id-326'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-327'/>
    <array-type-def dimensions='1' type-id='type-id-327' size-in-bits='192' id='type-id-328'>
      <subrange length='24' lower-bound='0' upper-bound='23' type-id='type-id-23' id='type-id-329'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-327' size-in-bits='64' id='type-id-330'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-23' id='type-id-331'/>
    </array-type-def>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-25'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-23'/>
    <reference-type-def kind='rvalue' type-id='type-id-306' size-in-bits='64' id='type-id-332'/>
    <pointer-type-def type-id='type-id-333' size-in-bits='64' id='type-id-334'/>
    <reference-type-def kind='lvalue' type-id='type-id-335' size-in-bits='64' id='type-id-336'/>
    <pointer-type-def type-id='type-id-335' size-in-bits='64' id='type-id-337'/>
    <reference-type-def kind='lvalue' type-id='type-id-338' size-in-bits='64' id='type-id-339'/>
    <pointer-type-def type-id='type-id-338' size-in-bits='64' id='type-id-340'/>
    <reference-type-def kind='lvalue' type-id='type-id-341' size-in-bits='64' id='type-id-342'/>
    <pointer-type-def type-id='type-id-341' size-in-bits='64' id='type-id-343'/>
    <pointer-type-def type-id='type-id-344' size-in-bits='64' id='type-id-345'/>
    <pointer-type-def type-id='type-id-346' size-in-bits='64' id='type-id-347'/>
    <pointer-type-def type-id='type-id-348' size-in-bits='64' id='type-id-349'/>
    <pointer-type-def type-id='type-id-350' size-in-bits='64' id='type-id-351'/>
    <pointer-type-def type-id='type-id-352' size-in-bits='64' id='type-id-353'/>
    <reference-type-def kind='lvalue' type-id='type-id-292' size-in-bits='64' id='type-id-354'/>
    <reference-type-def kind='rvalue' type-id='type-id-292' size-in-bits='64' id='type-id-355'/>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' id='type-id-356'/>
    <reference-type-def kind='lvalue' type-id='type-id-45' size-in-bits='64' id='type-id-357'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-9'/>
    <qualified-type-def type-id='type-id-9' const='yes' id='type-id-317'/>
    <reference-type-def kind='lvalue' type-id='type-id-317' size-in-bits='64' id='type-id-358'/>
    <qualified-type-def type-id='type-id-333' const='yes' id='type-id-359'/>
    <pointer-type-def type-id='type-id-359' size-in-bits='64' id='type-id-360'/>
    <qualified-type-def type-id='type-id-335' const='yes' id='type-id-361'/>
    <pointer-type-def type-id='type-id-361' size-in-bits='64' id='type-id-362'/>
    <qualified-type-def type-id='type-id-338' const='yes' id='type-id-363'/>
    <pointer-type-def type-id='type-id-363' size-in-bits='64' id='type-id-364'/>
    <qualified-type-def type-id='type-id-341' const='yes' id='type-id-365'/>
    <pointer-type-def type-id='type-id-365' size-in-bits='64' id='type-id-366'/>
    <qualified-type-def type-id='type-id-367' const='yes' id='type-id-368'/>
    <reference-type-def kind='lvalue' type-id='type-id-368' size-in-bits='64' id='type-id-369'/>
    <qualified-type-def type-id='type-id-344' const='yes' id='type-id-370'/>
    <reference-type-def kind='lvalue' type-id='type-id-370' size-in-bits='64' id='type-id-371'/>
    <pointer-type-def type-id='type-id-370' size-in-bits='64' id='type-id-372'/>
    <qualified-type-def type-id='type-id-346' const='yes' id='type-id-373'/>
    <reference-type-def kind='lvalue' type-id='type-id-373' size-in-bits='64' id='type-id-374'/>
    <pointer-type-def type-id='type-id-373' size-in-bits='64' id='type-id-375'/>
    <qualified-type-def type-id='type-id-348' const='yes' id='type-id-376'/>
    <reference-type-def kind='lvalue' type-id='type-id-376' size-in-bits='64' id='type-id-377'/>
    <pointer-type-def type-id='type-id-376' size-in-bits='64' id='type-id-378'/>
    <qualified-type-def type-id='type-id-350' const='yes' id='type-id-379'/>
    <reference-type-def kind='lvalue' type-id='type-id-379' size-in-bits='64' id='type-id-380'/>
    <pointer-type-def type-id='type-id-379' size-in-bits='64' id='type-id-381'/>
    <qualified-type-def type-id='type-id-352' const='yes' id='type-id-382'/>
    <reference-type-def kind='lvalue' type-id='type-id-382' size-in-bits='64' id='type-id-383'/>
    <pointer-type-def type-id='type-id-382' size-in-bits='64' id='type-id-384'/>
    <qualified-type-def type-id='type-id-292' const='yes' id='type-id-385'/>
    <reference-type-def kind='lvalue' type-id='type-id-385' size-in-bits='64' id='type-id-386'/>
    <reference-type-def kind='rvalue' type-id='type-id-385' size-in-bits='64' id='type-id-387'/>
    <qualified-type-def type-id='type-id-45' const='yes' id='type-id-388'/>
    <reference-type-def kind='lvalue' type-id='type-id-388' size-in-bits='64' id='type-id-389'/>
    <pointer-type-def type-id='type-id-388' size-in-bits='64' id='type-id-8'/>
    <qualified-type-def type-id='type-id-8' const='yes' id='type-id-313'/>
    <reference-type-def kind='lvalue' type-id='type-id-313' size-in-bits='64' id='type-id-390'/>
    <qualified-type-def type-id='type-id-18' const='yes' id='type-id-391'/>
    <reference-type-def kind='lvalue' type-id='type-id-391' size-in-bits='64' id='type-id-392'/>
    <reference-type-def kind='rvalue' type-id='type-id-391' size-in-bits='64' id='type-id-393'/>
    <qualified-type-def type-id='type-id-7' const='yes' id='type-id-394'/>
    <qualified-type-def type-id='type-id-15' const='yes' id='type-id-395'/>
    <reference-type-def kind='lvalue' type-id='type-id-395' size-in-bits='64' id='type-id-396'/>
    <reference-type-def kind='rvalue' type-id='type-id-395' size-in-bits='64' id='type-id-397'/>
    <qualified-type-def type-id='type-id-398' const='yes' id='type-id-399'/>
    <qualified-type-def type-id='type-id-400' const='yes' id='type-id-401'/>
    <qualified-type-def type-id='type-id-402' const='yes' id='type-id-403'/>
    <qualified-type-def type-id='type-id-404' const='yes' id='type-id-405'/>
    <reference-type-def kind='lvalue' type-id='type-id-405' size-in-bits='64' id='type-id-406'/>
    <qualified-type-def type-id='type-id-407' const='yes' id='type-id-408'/>
    <reference-type-def kind='lvalue' type-id='type-id-408' size-in-bits='64' id='type-id-409'/>
    <qualified-type-def type-id='type-id-410' const='yes' id='type-id-411'/>
    <pointer-type-def type-id='type-id-411' size-in-bits='64' id='type-id-412'/>
    <qualified-type-def type-id='type-id-413' const='yes' id='type-id-414'/>
    <reference-type-def kind='lvalue' type-id='type-id-414' size-in-bits='64' id='type-id-415'/>
    <qualified-type-def type-id='type-id-416' const='yes' id='type-id-417'/>
    <pointer-type-def type-id='type-id-417' size-in-bits='64' id='type-id-418'/>
    <qualified-type-def type-id='type-id-419' const='yes' id='type-id-420'/>
    <reference-type-def kind='lvalue' type-id='type-id-420' size-in-bits='64' id='type-id-421'/>
    <qualified-type-def type-id='type-id-422' const='yes' id='type-id-423'/>
    <reference-type-def kind='lvalue' type-id='type-id-423' size-in-bits='64' id='type-id-424'/>
    <qualified-type-def type-id='type-id-311' const='yes' id='type-id-425'/>
    <reference-type-def kind='lvalue' type-id='type-id-425' size-in-bits='64' id='type-id-309'/>
    <qualified-type-def type-id='type-id-315' const='yes' id='type-id-426'/>
    <reference-type-def kind='lvalue' type-id='type-id-426' size-in-bits='64' id='type-id-427'/>
    <qualified-type-def type-id='type-id-13' const='yes' id='type-id-314'/>
    <qualified-type-def type-id='type-id-428' const='yes' id='type-id-429'/>
    <reference-type-def kind='lvalue' type-id='type-id-429' size-in-bits='64' id='type-id-430'/>
    <qualified-type-def type-id='type-id-431' const='yes' id='type-id-432'/>
    <reference-type-def kind='lvalue' type-id='type-id-432' size-in-bits='64' id='type-id-433'/>
    <pointer-type-def type-id='type-id-432' size-in-bits='64' id='type-id-434'/>
    <qualified-type-def type-id='type-id-435' const='yes' id='type-id-436'/>
    <reference-type-def kind='lvalue' type-id='type-id-436' size-in-bits='64' id='type-id-437'/>
    <qualified-type-def type-id='type-id-438' const='yes' id='type-id-439'/>
    <reference-type-def kind='lvalue' type-id='type-id-439' size-in-bits='64' id='type-id-440'/>
    <qualified-type-def type-id='type-id-441' const='yes' id='type-id-442'/>
    <reference-type-def kind='lvalue' type-id='type-id-442' size-in-bits='64' id='type-id-443'/>
    <qualified-type-def type-id='type-id-444' const='yes' id='type-id-445'/>
    <reference-type-def kind='lvalue' type-id='type-id-445' size-in-bits='64' id='type-id-446'/>
    <qualified-type-def type-id='type-id-447' const='yes' id='type-id-448'/>
    <reference-type-def kind='lvalue' type-id='type-id-448' size-in-bits='64' id='type-id-449'/>
    <qualified-type-def type-id='type-id-450' const='yes' id='type-id-451'/>
    <reference-type-def kind='lvalue' type-id='type-id-451' size-in-bits='64' id='type-id-452'/>
    <qualified-type-def type-id='type-id-453' const='yes' id='type-id-454'/>
    <reference-type-def kind='lvalue' type-id='type-id-454' size-in-bits='64' id='type-id-455'/>
    <qualified-type-def type-id='type-id-456' const='yes' id='type-id-457'/>
    <reference-type-def kind='lvalue' type-id='type-id-457' size-in-bits='64' id='type-id-458'/>
    <qualified-type-def type-id='type-id-459' const='yes' id='type-id-460'/>
    <reference-type-def kind='lvalue' type-id='type-id-460' size-in-bits='64' id='type-id-461'/>
    <pointer-type-def type-id='type-id-460' size-in-bits='64' id='type-id-462'/>
    <qualified-type-def type-id='type-id-463' const='yes' id='type-id-464'/>
    <reference-type-def kind='lvalue' type-id='type-id-464' size-in-bits='64' id='type-id-465'/>
    <qualified-type-def type-id='type-id-466' const='yes' id='type-id-467'/>
    <reference-type-def kind='lvalue' type-id='type-id-467' size-in-bits='64' id='type-id-468'/>
    <qualified-type-def type-id='type-id-469' const='yes' id='type-id-470'/>
    <reference-type-def kind='lvalue' type-id='type-id-470' size-in-bits='64' id='type-id-471'/>
    <qualified-type-def type-id='type-id-472' const='yes' id='type-id-473'/>
    <reference-type-def kind='lvalue' type-id='type-id-473' size-in-bits='64' id='type-id-474'/>
    <qualified-type-def type-id='type-id-475' const='yes' id='type-id-476'/>
    <pointer-type-def type-id='type-id-476' size-in-bits='64' id='type-id-477'/>
    <qualified-type-def type-id='type-id-478' const='yes' id='type-id-479'/>
    <reference-type-def kind='lvalue' type-id='type-id-479' size-in-bits='64' id='type-id-480'/>
    <qualified-type-def type-id='type-id-481' const='yes' id='type-id-482'/>
    <reference-type-def kind='lvalue' type-id='type-id-482' size-in-bits='64' id='type-id-483'/>
    <qualified-type-def type-id='type-id-484' const='yes' id='type-id-485'/>
    <reference-type-def kind='lvalue' type-id='type-id-485' size-in-bits='64' id='type-id-486'/>
    <qualified-type-def type-id='type-id-487' const='yes' id='type-id-488'/>
    <pointer-type-def type-id='type-id-488' size-in-bits='64' id='type-id-489'/>
    <qualified-type-def type-id='type-id-490' const='yes' id='type-id-491'/>
    <reference-type-def kind='lvalue' type-id='type-id-491' size-in-bits='64' id='type-id-492'/>
    <qualified-type-def type-id='type-id-493' const='yes' id='type-id-494'/>
    <pointer-type-def type-id='type-id-494' size-in-bits='64' id='type-id-495'/>
    <qualified-type-def type-id='type-id-496' const='yes' id='type-id-497'/>
    <pointer-type-def type-id='type-id-497' size-in-bits='64' id='type-id-498'/>
    <qualified-type-def type-id='type-id-499' const='yes' id='type-id-500'/>
    <reference-type-def kind='lvalue' type-id='type-id-500' size-in-bits='64' id='type-id-501'/>
    <pointer-type-def type-id='type-id-500' size-in-bits='64' id='type-id-502'/>
    <qualified-type-def type-id='type-id-503' const='yes' id='type-id-504'/>
    <pointer-type-def type-id='type-id-504' size-in-bits='64' id='type-id-505'/>
    <qualified-type-def type-id='type-id-506' const='yes' id='type-id-507'/>
    <reference-type-def kind='lvalue' type-id='type-id-507' size-in-bits='64' id='type-id-508'/>
    <pointer-type-def type-id='type-id-507' size-in-bits='64' id='type-id-509'/>
    <qualified-type-def type-id='type-id-510' const='yes' id='type-id-511'/>
    <reference-type-def kind='lvalue' type-id='type-id-511' size-in-bits='64' id='type-id-512'/>
    <qualified-type-def type-id='type-id-513' const='yes' id='type-id-514'/>
    <pointer-type-def type-id='type-id-514' size-in-bits='64' id='type-id-515'/>
    <qualified-type-def type-id='type-id-516' const='yes' id='type-id-517'/>
    <reference-type-def kind='lvalue' type-id='type-id-517' size-in-bits='64' id='type-id-518'/>
    <qualified-type-def type-id='type-id-519' const='yes' id='type-id-520'/>
    <reference-type-def kind='lvalue' type-id='type-id-520' size-in-bits='64' id='type-id-521'/>
    <qualified-type-def type-id='type-id-522' const='yes' id='type-id-523'/>
    <reference-type-def kind='lvalue' type-id='type-id-523' size-in-bits='64' id='type-id-524'/>
    <qualified-type-def type-id='type-id-525' const='yes' id='type-id-526'/>
    <reference-type-def kind='lvalue' type-id='type-id-526' size-in-bits='64' id='type-id-527'/>
    <qualified-type-def type-id='type-id-528' const='yes' id='type-id-529'/>
    <reference-type-def kind='lvalue' type-id='type-id-529' size-in-bits='64' id='type-id-530'/>
    <qualified-type-def type-id='type-id-531' const='yes' id='type-id-532'/>
    <reference-type-def kind='lvalue' type-id='type-id-532' size-in-bits='64' id='type-id-533'/>
    <qualified-type-def type-id='type-id-534' const='yes' id='type-id-535'/>
    <pointer-type-def type-id='type-id-535' size-in-bits='64' id='type-id-536'/>
    <qualified-type-def type-id='type-id-537' const='yes' id='type-id-538'/>
    <reference-type-def kind='lvalue' type-id='type-id-538' size-in-bits='64' id='type-id-539'/>
    <qualified-type-def type-id='type-id-540' const='yes' id='type-id-541'/>
    <reference-type-def kind='lvalue' type-id='type-id-541' size-in-bits='64' id='type-id-542'/>
    <qualified-type-def type-id='type-id-543' const='yes' id='type-id-544'/>
    <reference-type-def kind='lvalue' type-id='type-id-544' size-in-bits='64' id='type-id-545'/>
    <pointer-type-def type-id='type-id-544' size-in-bits='64' id='type-id-546'/>
    <qualified-type-def type-id='type-id-547' const='yes' id='type-id-548'/>
    <pointer-type-def type-id='type-id-548' size-in-bits='64' id='type-id-549'/>
    <qualified-type-def type-id='type-id-550' const='yes' id='type-id-551'/>
    <reference-type-def kind='lvalue' type-id='type-id-551' size-in-bits='64' id='type-id-552'/>
    <pointer-type-def type-id='type-id-551' size-in-bits='64' id='type-id-553'/>
    <qualified-type-def type-id='type-id-554' const='yes' id='type-id-555'/>
    <reference-type-def kind='lvalue' type-id='type-id-555' size-in-bits='64' id='type-id-556'/>
    <qualified-type-def type-id='type-id-557' const='yes' id='type-id-558'/>
    <reference-type-def kind='lvalue' type-id='type-id-558' size-in-bits='64' id='type-id-559'/>
    <pointer-type-def type-id='type-id-558' size-in-bits='64' id='type-id-560'/>
    <qualified-type-def type-id='type-id-561' const='yes' id='type-id-562'/>
    <pointer-type-def type-id='type-id-562' size-in-bits='64' id='type-id-563'/>
    <qualified-type-def type-id='type-id-564' const='yes' id='type-id-565'/>
    <reference-type-def kind='lvalue' type-id='type-id-565' size-in-bits='64' id='type-id-566'/>
    <pointer-type-def type-id='type-id-565' size-in-bits='64' id='type-id-567'/>
    <qualified-type-def type-id='type-id-568' const='yes' id='type-id-569'/>
    <reference-type-def kind='lvalue' type-id='type-id-569' size-in-bits='64' id='type-id-570'/>
    <qualified-type-def type-id='type-id-571' const='yes' id='type-id-572'/>
    <reference-type-def kind='lvalue' type-id='type-id-572' size-in-bits='64' id='type-id-573'/>
    <qualified-type-def type-id='type-id-574' const='yes' id='type-id-575'/>
    <reference-type-def kind='lvalue' type-id='type-id-575' size-in-bits='64' id='type-id-576'/>
    <qualified-type-def type-id='type-id-577' const='yes' id='type-id-578'/>
    <reference-type-def kind='lvalue' type-id='type-id-578' size-in-bits='64' id='type-id-579'/>
    <qualified-type-def type-id='type-id-580' const='yes' id='type-id-581'/>
    <pointer-type-def type-id='type-id-581' size-in-bits='64' id='type-id-582'/>
    <qualified-type-def type-id='type-id-583' const='yes' id='type-id-584'/>
    <reference-type-def kind='lvalue' type-id='type-id-584' size-in-bits='64' id='type-id-585'/>
    <qualified-type-def type-id='type-id-298' const='yes' id='type-id-586'/>
    <pointer-type-def type-id='type-id-586' size-in-bits='64' id='type-id-587'/>
    <qualified-type-def type-id='type-id-588' const='yes' id='type-id-589'/>
    <qualified-type-def type-id='type-id-590' const='yes' id='type-id-591'/>
    <pointer-type-def type-id='type-id-591' size-in-bits='64' id='type-id-592'/>
    <qualified-type-def type-id='type-id-593' const='yes' id='type-id-594'/>
    <pointer-type-def type-id='type-id-594' size-in-bits='64' id='type-id-595'/>
    <qualified-type-def type-id='type-id-596' const='yes' id='type-id-597'/>
    <pointer-type-def type-id='type-id-597' size-in-bits='64' id='type-id-598'/>
    <qualified-type-def type-id='type-id-599' const='yes' id='type-id-600'/>
    <pointer-type-def type-id='type-id-600' size-in-bits='64' id='type-id-601'/>
    <qualified-type-def type-id='type-id-602' const='yes' id='type-id-603'/>
    <reference-type-def kind='lvalue' type-id='type-id-603' size-in-bits='64' id='type-id-604'/>
    <qualified-type-def type-id='type-id-605' const='yes' id='type-id-606'/>
    <reference-type-def kind='lvalue' type-id='type-id-606' size-in-bits='64' id='type-id-607'/>
    <qualified-type-def type-id='type-id-608' const='yes' id='type-id-609'/>
    <reference-type-def kind='lvalue' type-id='type-id-609' size-in-bits='64' id='type-id-610'/>
    <qualified-type-def type-id='type-id-611' const='yes' id='type-id-612'/>
    <reference-type-def kind='lvalue' type-id='type-id-612' size-in-bits='64' id='type-id-613'/>
    <qualified-type-def type-id='type-id-614' const='yes' id='type-id-615'/>
    <reference-type-def kind='lvalue' type-id='type-id-615' size-in-bits='64' id='type-id-616'/>
    <qualified-type-def type-id='type-id-617' const='yes' id='type-id-618'/>
    <pointer-type-def type-id='type-id-618' size-in-bits='64' id='type-id-619'/>
    <qualified-type-def type-id='type-id-620' const='yes' id='type-id-621'/>
    <qualified-type-def type-id='type-id-622' const='yes' id='type-id-623'/>
    <qualified-type-def type-id='type-id-624' const='yes' id='type-id-625'/>
    <reference-type-def kind='lvalue' type-id='type-id-625' size-in-bits='64' id='type-id-626'/>
    <pointer-type-def type-id='type-id-625' size-in-bits='64' id='type-id-627'/>
    <qualified-type-def type-id='type-id-628' const='yes' id='type-id-629'/>
    <reference-type-def kind='lvalue' type-id='type-id-629' size-in-bits='64' id='type-id-630'/>
    <qualified-type-def type-id='type-id-631' const='yes' id='type-id-632'/>
    <reference-type-def kind='lvalue' type-id='type-id-632' size-in-bits='64' id='type-id-633'/>
    <qualified-type-def type-id='type-id-634' const='yes' id='type-id-635'/>
    <reference-type-def kind='lvalue' type-id='type-id-635' size-in-bits='64' id='type-id-636'/>
    <qualified-type-def type-id='type-id-637' const='yes' id='type-id-638'/>
    <reference-type-def kind='lvalue' type-id='type-id-638' size-in-bits='64' id='type-id-639'/>
    <qualified-type-def type-id='type-id-640' const='yes' id='type-id-641'/>
    <reference-type-def kind='lvalue' type-id='type-id-641' size-in-bits='64' id='type-id-642'/>
    <qualified-type-def type-id='type-id-643' const='yes' id='type-id-644'/>
    <reference-type-def kind='lvalue' type-id='type-id-644' size-in-bits='64' id='type-id-645'/>
    <pointer-type-def type-id='type-id-644' size-in-bits='64' id='type-id-646'/>
    <qualified-type-def type-id='type-id-647' const='yes' id='type-id-648'/>
    <reference-type-def kind='lvalue' type-id='type-id-648' size-in-bits='64' id='type-id-649'/>
    <pointer-type-def type-id='type-id-648' size-in-bits='64' id='type-id-650'/>
    <qualified-type-def type-id='type-id-651' const='yes' id='type-id-652'/>
    <reference-type-def kind='lvalue' type-id='type-id-652' size-in-bits='64' id='type-id-653'/>
    <pointer-type-def type-id='type-id-652' size-in-bits='64' id='type-id-654'/>
    <qualified-type-def type-id='type-id-655' const='yes' id='type-id-656'/>
    <reference-type-def kind='lvalue' type-id='type-id-656' size-in-bits='64' id='type-id-657'/>
    <pointer-type-def type-id='type-id-656' size-in-bits='64' id='type-id-658'/>
    <qualified-type-def type-id='type-id-659' const='yes' id='type-id-660'/>
    <reference-type-def kind='lvalue' type-id='type-id-660' size-in-bits='64' id='type-id-661'/>
    <pointer-type-def type-id='type-id-660' size-in-bits='64' id='type-id-662'/>
    <qualified-type-def type-id='type-id-663' const='yes' id='type-id-664'/>
    <reference-type-def kind='lvalue' type-id='type-id-664' size-in-bits='64' id='type-id-665'/>
    <pointer-type-def type-id='type-id-664' size-in-bits='64' id='type-id-666'/>
    <qualified-type-def type-id='type-id-667' const='yes' id='type-id-668'/>
    <pointer-type-def type-id='type-id-668' size-in-bits='64' id='type-id-669'/>
    <qualified-type-def type-id='type-id-670' const='yes' id='type-id-671'/>
    <pointer-type-def type-id='type-id-671' size-in-bits='64' id='type-id-672'/>
    <qualified-type-def type-id='type-id-673' const='yes' id='type-id-674'/>
    <pointer-type-def type-id='type-id-674' size-in-bits='64' id='type-id-675'/>
    <qualified-type-def type-id='type-id-676' const='yes' id='type-id-677'/>
    <pointer-type-def type-id='type-id-677' size-in-bits='64' id='type-id-678'/>
    <qualified-type-def type-id='type-id-679' const='yes' id='type-id-680'/>
    <pointer-type-def type-id='type-id-680' size-in-bits='64' id='type-id-681'/>
    <qualified-type-def type-id='type-id-682' const='yes' id='type-id-683'/>
    <reference-type-def kind='lvalue' type-id='type-id-683' size-in-bits='64' id='type-id-684'/>
    <qualified-type-def type-id='type-id-685' const='yes' id='type-id-686'/>
    <reference-type-def kind='lvalue' type-id='type-id-686' size-in-bits='64' id='type-id-687'/>
    <qualified-type-def type-id='type-id-688' const='yes' id='type-id-689'/>
    <reference-type-def kind='lvalue' type-id='type-id-689' size-in-bits='64' id='type-id-690'/>
    <qualified-type-def type-id='type-id-691' const='yes' id='type-id-692'/>
    <reference-type-def kind='lvalue' type-id='type-id-692' size-in-bits='64' id='type-id-693'/>
    <qualified-type-def type-id='type-id-694' const='yes' id='type-id-695'/>
    <reference-type-def kind='lvalue' type-id='type-id-695' size-in-bits='64' id='type-id-696'/>
    <qualified-type-def type-id='type-id-697' const='yes' id='type-id-698'/>
    <reference-type-def kind='lvalue' type-id='type-id-698' size-in-bits='64' id='type-id-699'/>
    <qualified-type-def type-id='type-id-700' const='yes' id='type-id-701'/>
    <reference-type-def kind='lvalue' type-id='type-id-701' size-in-bits='64' id='type-id-702'/>
    <qualified-type-def type-id='type-id-703' const='yes' id='type-id-704'/>
    <reference-type-def kind='lvalue' type-id='type-id-704' size-in-bits='64' id='type-id-705'/>
    <qualified-type-def type-id='type-id-706' const='yes' id='type-id-707'/>
    <pointer-type-def type-id='type-id-707' size-in-bits='64' id='type-id-708'/>
    <qualified-type-def type-id='type-id-709' const='yes' id='type-id-710'/>
    <reference-type-def kind='lvalue' type-id='type-id-710' size-in-bits='64' id='type-id-711'/>
    <reference-type-def kind='rvalue' type-id='type-id-710' size-in-bits='64' id='type-id-712'/>
    <pointer-type-def type-id='type-id-710' size-in-bits='64' id='type-id-713'/>
    <qualified-type-def type-id='type-id-714' const='yes' id='type-id-715'/>
    <pointer-type-def type-id='type-id-715' size-in-bits='64' id='type-id-716'/>
    <qualified-type-def type-id='type-id-302' const='yes' id='type-id-717'/>
    <qualified-type-def type-id='type-id-718' const='yes' id='type-id-719'/>
    <reference-type-def kind='lvalue' type-id='type-id-719' size-in-bits='64' id='type-id-720'/>
    <qualified-type-def type-id='type-id-721' const='yes' id='type-id-722'/>
    <reference-type-def kind='lvalue' type-id='type-id-722' size-in-bits='64' id='type-id-723'/>
    <pointer-type-def type-id='type-id-722' size-in-bits='64' id='type-id-724'/>
    <qualified-type-def type-id='type-id-725' const='yes' id='type-id-726'/>
    <qualified-type-def type-id='type-id-727' const='yes' id='type-id-728'/>
    <reference-type-def kind='lvalue' type-id='type-id-728' size-in-bits='64' id='type-id-729'/>
    <pointer-type-def type-id='type-id-728' size-in-bits='64' id='type-id-730'/>
    <qualified-type-def type-id='type-id-731' const='yes' id='type-id-732'/>
    <reference-type-def kind='lvalue' type-id='type-id-732' size-in-bits='64' id='type-id-733'/>
    <pointer-type-def type-id='type-id-732' size-in-bits='64' id='type-id-734'/>
    <qualified-type-def type-id='type-id-735' const='yes' id='type-id-736'/>
    <reference-type-def kind='lvalue' type-id='type-id-736' size-in-bits='64' id='type-id-737'/>
    <qualified-type-def type-id='type-id-738' const='yes' id='type-id-739'/>
    <reference-type-def kind='lvalue' type-id='type-id-739' size-in-bits='64' id='type-id-740'/>
    <pointer-type-def type-id='type-id-739' size-in-bits='64' id='type-id-741'/>
    <qualified-type-def type-id='type-id-742' const='yes' id='type-id-743'/>
    <reference-type-def kind='lvalue' type-id='type-id-743' size-in-bits='64' id='type-id-744'/>
    <pointer-type-def type-id='type-id-743' size-in-bits='64' id='type-id-745'/>
    <qualified-type-def type-id='type-id-746' const='yes' id='type-id-747'/>
    <pointer-type-def type-id='type-id-747' size-in-bits='64' id='type-id-748'/>
    <qualified-type-def type-id='type-id-749' const='yes' id='type-id-750'/>
    <pointer-type-def type-id='type-id-750' size-in-bits='64' id='type-id-751'/>
    <qualified-type-def type-id='type-id-752' const='yes' id='type-id-753'/>
    <pointer-type-def type-id='type-id-753' size-in-bits='64' id='type-id-754'/>
    <qualified-type-def type-id='type-id-755' const='yes' id='type-id-756'/>
    <pointer-type-def type-id='type-id-756' size-in-bits='64' id='type-id-757'/>
    <qualified-type-def type-id='type-id-758' const='yes' id='type-id-759'/>
    <pointer-type-def type-id='type-id-759' size-in-bits='64' id='type-id-760'/>
    <qualified-type-def type-id='type-id-761' const='yes' id='type-id-762'/>
    <reference-type-def kind='lvalue' type-id='type-id-762' size-in-bits='64' id='type-id-763'/>
    <qualified-type-def type-id='type-id-764' const='yes' id='type-id-765'/>
    <reference-type-def kind='lvalue' type-id='type-id-765' size-in-bits='64' id='type-id-766'/>
    <pointer-type-def type-id='type-id-765' size-in-bits='64' id='type-id-767'/>
    <qualified-type-def type-id='type-id-768' const='yes' id='type-id-769'/>
    <reference-type-def kind='lvalue' type-id='type-id-769' size-in-bits='64' id='type-id-770'/>
    <qualified-type-def type-id='type-id-771' const='yes' id='type-id-772'/>
    <reference-type-def kind='lvalue' type-id='type-id-772' size-in-bits='64' id='type-id-773'/>
    <qualified-type-def type-id='type-id-774' const='yes' id='type-id-775'/>
    <reference-type-def kind='lvalue' type-id='type-id-775' size-in-bits='64' id='type-id-776'/>
    <qualified-type-def type-id='type-id-777' const='yes' id='type-id-778'/>
    <reference-type-def kind='lvalue' type-id='type-id-778' size-in-bits='64' id='type-id-779'/>
    <qualified-type-def type-id='type-id-780' const='yes' id='type-id-781'/>
    <reference-type-def kind='lvalue' type-id='type-id-781' size-in-bits='64' id='type-id-782'/>
    <qualified-type-def type-id='type-id-783' const='yes' id='type-id-784'/>
    <reference-type-def kind='lvalue' type-id='type-id-784' size-in-bits='64' id='type-id-785'/>
    <qualified-type-def type-id='type-id-786' const='yes' id='type-id-787'/>
    <reference-type-def kind='lvalue' type-id='type-id-787' size-in-bits='64' id='type-id-788'/>
    <qualified-type-def type-id='type-id-789' const='yes' id='type-id-790'/>
    <reference-type-def kind='lvalue' type-id='type-id-790' size-in-bits='64' id='type-id-791'/>
    <qualified-type-def type-id='type-id-792' const='yes' id='type-id-793'/>
    <reference-type-def kind='lvalue' type-id='type-id-793' size-in-bits='64' id='type-id-794'/>
    <qualified-type-def type-id='type-id-795' const='yes' id='type-id-796'/>
    <reference-type-def kind='lvalue' type-id='type-id-796' size-in-bits='64' id='type-id-797'/>
    <qualified-type-def type-id='type-id-798' const='yes' id='type-id-799'/>
    <reference-type-def kind='lvalue' type-id='type-id-799' size-in-bits='64' id='type-id-800'/>
    <qualified-type-def type-id='type-id-801' const='yes' id='type-id-802'/>
    <reference-type-def kind='lvalue' type-id='type-id-802' size-in-bits='64' id='type-id-803'/>
    <qualified-type-def type-id='type-id-804' const='yes' id='type-id-805'/>
    <reference-type-def kind='lvalue' type-id='type-id-805' size-in-bits='64' id='type-id-806'/>
    <pointer-type-def type-id='type-id-805' size-in-bits='64' id='type-id-807'/>
    <qualified-type-def type-id='type-id-808' const='yes' id='type-id-809'/>
    <reference-type-def kind='lvalue' type-id='type-id-809' size-in-bits='64' id='type-id-810'/>
    <qualified-type-def type-id='type-id-811' const='yes' id='type-id-812'/>
    <reference-type-def kind='lvalue' type-id='type-id-812' size-in-bits='64' id='type-id-813'/>
    <qualified-type-def type-id='type-id-814' const='yes' id='type-id-815'/>
    <reference-type-def kind='lvalue' type-id='type-id-815' size-in-bits='64' id='type-id-816'/>
    <qualified-type-def type-id='type-id-817' const='yes' id='type-id-818'/>
    <reference-type-def kind='lvalue' type-id='type-id-818' size-in-bits='64' id='type-id-819'/>
    <qualified-type-def type-id='type-id-820' const='yes' id='type-id-821'/>
    <reference-type-def kind='lvalue' type-id='type-id-821' size-in-bits='64' id='type-id-822'/>
    <pointer-type-def type-id='type-id-821' size-in-bits='64' id='type-id-823'/>
    <qualified-type-def type-id='type-id-824' const='yes' id='type-id-825'/>
    <qualified-type-def type-id='type-id-826' const='yes' id='type-id-827'/>
    <qualified-type-def type-id='type-id-828' const='yes' id='type-id-829'/>
    <qualified-type-def type-id='type-id-830' const='yes' id='type-id-831'/>
    <reference-type-def kind='lvalue' type-id='type-id-827' size-in-bits='64' id='type-id-832'/>
    <qualified-type-def type-id='type-id-833' const='yes' id='type-id-834'/>
    <reference-type-def kind='lvalue' type-id='type-id-834' size-in-bits='64' id='type-id-835'/>
    <pointer-type-def type-id='type-id-834' size-in-bits='64' id='type-id-836'/>
    <qualified-type-def type-id='type-id-837' const='yes' id='type-id-838'/>
    <reference-type-def kind='lvalue' type-id='type-id-838' size-in-bits='64' id='type-id-839'/>
    <qualified-type-def type-id='type-id-327' const='yes' id='type-id-840'/>
    <qualified-type-def type-id='type-id-23' const='yes' id='type-id-841'/>
    <reference-type-def kind='lvalue' type-id='type-id-841' size-in-bits='64' id='type-id-842'/>
    <reference-type-def kind='lvalue' type-id='type-id-18' size-in-bits='64' id='type-id-843'/>
    <reference-type-def kind='rvalue' type-id='type-id-18' size-in-bits='64' id='type-id-844'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-845'/>
    <pointer-type-def type-id='type-id-846' size-in-bits='64' id='type-id-847'/>
    <reference-type-def kind='lvalue' type-id='type-id-15' size-in-bits='64' id='type-id-848'/>
    <reference-type-def kind='rvalue' type-id='type-id-15' size-in-bits='64' id='type-id-849'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-850'/>
    <pointer-type-def type-id='type-id-398' size-in-bits='64' id='type-id-851'/>
    <pointer-type-def type-id='type-id-400' size-in-bits='64' id='type-id-852'/>
    <pointer-type-def type-id='type-id-402' size-in-bits='64' id='type-id-853'/>
    <pointer-type-def type-id='type-id-410' size-in-bits='64' id='type-id-854'/>
    <pointer-type-def type-id='type-id-416' size-in-bits='64' id='type-id-855'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' id='type-id-856'/>
    <reference-type-def kind='lvalue' type-id='type-id-856' size-in-bits='64' id='type-id-307'/>
    <pointer-type-def type-id='type-id-315' size-in-bits='64' id='type-id-857'/>
    <reference-type-def kind='lvalue' type-id='type-id-428' size-in-bits='64' id='type-id-858'/>
    <reference-type-def kind='rvalue' type-id='type-id-428' size-in-bits='64' id='type-id-859'/>
    <pointer-type-def type-id='type-id-428' size-in-bits='64' id='type-id-860'/>
    <pointer-type-def type-id='type-id-861' size-in-bits='64' id='type-id-862'/>
    <reference-type-def kind='lvalue' type-id='type-id-431' size-in-bits='64' id='type-id-863'/>
    <reference-type-def kind='rvalue' type-id='type-id-431' size-in-bits='64' id='type-id-864'/>
    <pointer-type-def type-id='type-id-431' size-in-bits='64' id='type-id-865'/>
    <pointer-type-def type-id='type-id-866' size-in-bits='64' id='type-id-867'/>
    <reference-type-def kind='lvalue' type-id='type-id-868' size-in-bits='64' id='type-id-869'/>
    <pointer-type-def type-id='type-id-870' size-in-bits='64' id='type-id-871'/>
    <reference-type-def kind='lvalue' type-id='type-id-447' size-in-bits='64' id='type-id-872'/>
    <reference-type-def kind='rvalue' type-id='type-id-447' size-in-bits='64' id='type-id-873'/>
    <pointer-type-def type-id='type-id-447' size-in-bits='64' id='type-id-874'/>
    <reference-type-def kind='lvalue' type-id='type-id-450' size-in-bits='64' id='type-id-875'/>
    <reference-type-def kind='rvalue' type-id='type-id-450' size-in-bits='64' id='type-id-876'/>
    <pointer-type-def type-id='type-id-450' size-in-bits='64' id='type-id-877'/>
    <reference-type-def kind='lvalue' type-id='type-id-453' size-in-bits='64' id='type-id-878'/>
    <reference-type-def kind='rvalue' type-id='type-id-453' size-in-bits='64' id='type-id-879'/>
    <pointer-type-def type-id='type-id-453' size-in-bits='64' id='type-id-880'/>
    <reference-type-def kind='lvalue' type-id='type-id-456' size-in-bits='64' id='type-id-881'/>
    <reference-type-def kind='rvalue' type-id='type-id-456' size-in-bits='64' id='type-id-882'/>
    <pointer-type-def type-id='type-id-456' size-in-bits='64' id='type-id-883'/>
    <reference-type-def kind='lvalue' type-id='type-id-459' size-in-bits='64' id='type-id-884'/>
    <pointer-type-def type-id='type-id-459' size-in-bits='64' id='type-id-885'/>
    <reference-type-def kind='lvalue' type-id='type-id-463' size-in-bits='64' id='type-id-886'/>
    <reference-type-def kind='rvalue' type-id='type-id-463' size-in-bits='64' id='type-id-887'/>
    <pointer-type-def type-id='type-id-463' size-in-bits='64' id='type-id-888'/>
    <reference-type-def kind='lvalue' type-id='type-id-466' size-in-bits='64' id='type-id-889'/>
    <reference-type-def kind='rvalue' type-id='type-id-466' size-in-bits='64' id='type-id-890'/>
    <pointer-type-def type-id='type-id-466' size-in-bits='64' id='type-id-891'/>
    <reference-type-def kind='lvalue' type-id='type-id-469' size-in-bits='64' id='type-id-892'/>
    <reference-type-def kind='rvalue' type-id='type-id-469' size-in-bits='64' id='type-id-893'/>
    <pointer-type-def type-id='type-id-469' size-in-bits='64' id='type-id-894'/>
    <reference-type-def kind='lvalue' type-id='type-id-472' size-in-bits='64' id='type-id-895'/>
    <reference-type-def kind='rvalue' type-id='type-id-472' size-in-bits='64' id='type-id-896'/>
    <pointer-type-def type-id='type-id-472' size-in-bits='64' id='type-id-897'/>
    <reference-type-def kind='rvalue' type-id='type-id-475' size-in-bits='64' id='type-id-898'/>
    <pointer-type-def type-id='type-id-475' size-in-bits='64' id='type-id-899'/>
    <reference-type-def kind='lvalue' type-id='type-id-478' size-in-bits='64' id='type-id-900'/>
    <reference-type-def kind='rvalue' type-id='type-id-478' size-in-bits='64' id='type-id-901'/>
    <reference-type-def kind='rvalue' type-id='type-id-902' size-in-bits='64' id='type-id-903'/>
    <pointer-type-def type-id='type-id-902' size-in-bits='64' id='type-id-904'/>
    <reference-type-def kind='lvalue' type-id='type-id-481' size-in-bits='64' id='type-id-905'/>
    <reference-type-def kind='rvalue' type-id='type-id-481' size-in-bits='64' id='type-id-906'/>
    <pointer-type-def type-id='type-id-481' size-in-bits='64' id='type-id-907'/>
    <reference-type-def kind='lvalue' type-id='type-id-493' size-in-bits='64' id='type-id-908'/>
    <pointer-type-def type-id='type-id-493' size-in-bits='64' id='type-id-909'/>
    <pointer-type-def type-id='type-id-496' size-in-bits='64' id='type-id-910'/>
    <reference-type-def kind='lvalue' type-id='type-id-499' size-in-bits='64' id='type-id-911'/>
    <pointer-type-def type-id='type-id-499' size-in-bits='64' id='type-id-912'/>
    <pointer-type-def type-id='type-id-913' size-in-bits='64' id='type-id-914'/>
    <qualified-type-def type-id='type-id-914' const='yes' id='type-id-915'/>
    <reference-type-def kind='lvalue' type-id='type-id-915' size-in-bits='64' id='type-id-916'/>
    <pointer-type-def type-id='type-id-915' size-in-bits='64' id='type-id-917'/>
    <reference-type-def kind='lvalue' type-id='type-id-914' size-in-bits='64' id='type-id-918'/>
    <pointer-type-def type-id='type-id-914' size-in-bits='64' id='type-id-919'/>
    <pointer-type-def type-id='type-id-503' size-in-bits='64' id='type-id-920'/>
    <reference-type-def kind='rvalue' type-id='type-id-506' size-in-bits='64' id='type-id-921'/>
    <pointer-type-def type-id='type-id-506' size-in-bits='64' id='type-id-922'/>
    <pointer-type-def type-id='type-id-923' size-in-bits='64' id='type-id-924'/>
    <reference-type-def kind='lvalue' type-id='type-id-510' size-in-bits='64' id='type-id-925'/>
    <pointer-type-def type-id='type-id-926' size-in-bits='64' id='type-id-927'/>
    <pointer-type-def type-id='type-id-928' size-in-bits='64' id='type-id-929'/>
    <reference-type-def kind='lvalue' type-id='type-id-513' size-in-bits='64' id='type-id-930'/>
    <pointer-type-def type-id='type-id-513' size-in-bits='64' id='type-id-931'/>
    <pointer-type-def type-id='type-id-932' size-in-bits='64' id='type-id-933'/>
    <reference-type-def kind='lvalue' type-id='type-id-516' size-in-bits='64' id='type-id-934'/>
    <pointer-type-def type-id='type-id-516' size-in-bits='64' id='type-id-935'/>
    <reference-type-def kind='lvalue' type-id='type-id-519' size-in-bits='64' id='type-id-936'/>
    <pointer-type-def type-id='type-id-519' size-in-bits='64' id='type-id-937'/>
    <reference-type-def kind='lvalue' type-id='type-id-522' size-in-bits='64' id='type-id-938'/>
    <pointer-type-def type-id='type-id-522' size-in-bits='64' id='type-id-939'/>
    <reference-type-def kind='lvalue' type-id='type-id-525' size-in-bits='64' id='type-id-940'/>
    <pointer-type-def type-id='type-id-525' size-in-bits='64' id='type-id-941'/>
    <reference-type-def kind='lvalue' type-id='type-id-528' size-in-bits='64' id='type-id-942'/>
    <pointer-type-def type-id='type-id-528' size-in-bits='64' id='type-id-943'/>
    <pointer-type-def type-id='type-id-944' size-in-bits='64' id='type-id-945'/>
    <reference-type-def kind='lvalue' type-id='type-id-490' size-in-bits='64' id='type-id-946'/>
    <pointer-type-def type-id='type-id-534' size-in-bits='64' id='type-id-947'/>
    <reference-type-def kind='rvalue' type-id='type-id-537' size-in-bits='64' id='type-id-948'/>
    <reference-type-def kind='lvalue' type-id='type-id-540' size-in-bits='64' id='type-id-949'/>
    <reference-type-def kind='lvalue' type-id='type-id-543' size-in-bits='64' id='type-id-950'/>
    <reference-type-def kind='lvalue' type-id='type-id-547' size-in-bits='64' id='type-id-951'/>
    <pointer-type-def type-id='type-id-547' size-in-bits='64' id='type-id-952'/>
    <reference-type-def kind='lvalue' type-id='type-id-550' size-in-bits='64' id='type-id-953'/>
    <reference-type-def kind='rvalue' type-id='type-id-550' size-in-bits='64' id='type-id-954'/>
    <pointer-type-def type-id='type-id-550' size-in-bits='64' id='type-id-955'/>
    <pointer-type-def type-id='type-id-554' size-in-bits='64' id='type-id-956'/>
    <pointer-type-def type-id='type-id-557' size-in-bits='64' id='type-id-957'/>
    <pointer-type-def type-id='type-id-561' size-in-bits='64' id='type-id-958'/>
    <reference-type-def kind='lvalue' type-id='type-id-564' size-in-bits='64' id='type-id-959'/>
    <reference-type-def kind='lvalue' type-id='type-id-568' size-in-bits='64' id='type-id-960'/>
    <reference-type-def kind='rvalue' type-id='type-id-568' size-in-bits='64' id='type-id-961'/>
    <pointer-type-def type-id='type-id-568' size-in-bits='64' id='type-id-962'/>
    <reference-type-def kind='lvalue' type-id='type-id-571' size-in-bits='64' id='type-id-963'/>
    <reference-type-def kind='rvalue' type-id='type-id-571' size-in-bits='64' id='type-id-964'/>
    <pointer-type-def type-id='type-id-571' size-in-bits='64' id='type-id-965'/>
    <reference-type-def kind='lvalue' type-id='type-id-574' size-in-bits='64' id='type-id-966'/>
    <reference-type-def kind='rvalue' type-id='type-id-574' size-in-bits='64' id='type-id-967'/>
    <pointer-type-def type-id='type-id-574' size-in-bits='64' id='type-id-968'/>
    <reference-type-def kind='lvalue' type-id='type-id-577' size-in-bits='64' id='type-id-969'/>
    <reference-type-def kind='rvalue' type-id='type-id-577' size-in-bits='64' id='type-id-970'/>
    <pointer-type-def type-id='type-id-577' size-in-bits='64' id='type-id-971'/>
    <pointer-type-def type-id='type-id-590' size-in-bits='64' id='type-id-972'/>
    <pointer-type-def type-id='type-id-593' size-in-bits='64' id='type-id-973'/>
    <pointer-type-def type-id='type-id-596' size-in-bits='64' id='type-id-974'/>
    <pointer-type-def type-id='type-id-599' size-in-bits='64' id='type-id-975'/>
    <reference-type-def kind='lvalue' type-id='type-id-602' size-in-bits='64' id='type-id-976'/>
    <pointer-type-def type-id='type-id-602' size-in-bits='64' id='type-id-977'/>
    <reference-type-def kind='lvalue' type-id='type-id-605' size-in-bits='64' id='type-id-978'/>
    <pointer-type-def type-id='type-id-605' size-in-bits='64' id='type-id-979'/>
    <reference-type-def kind='lvalue' type-id='type-id-608' size-in-bits='64' id='type-id-980'/>
    <pointer-type-def type-id='type-id-608' size-in-bits='64' id='type-id-981'/>
    <reference-type-def kind='lvalue' type-id='type-id-611' size-in-bits='64' id='type-id-982'/>
    <pointer-type-def type-id='type-id-611' size-in-bits='64' id='type-id-983'/>
    <reference-type-def kind='lvalue' type-id='type-id-614' size-in-bits='64' id='type-id-984'/>
    <reference-type-def kind='rvalue' type-id='type-id-614' size-in-bits='64' id='type-id-985'/>
    <pointer-type-def type-id='type-id-614' size-in-bits='64' id='type-id-986'/>
    <reference-type-def kind='lvalue' type-id='type-id-617' size-in-bits='64' id='type-id-987'/>
    <pointer-type-def type-id='type-id-617' size-in-bits='64' id='type-id-988'/>
    <reference-type-def kind='rvalue' type-id='type-id-989' size-in-bits='64' id='type-id-289'/>
    <reference-type-def kind='lvalue' type-id='type-id-624' size-in-bits='64' id='type-id-990'/>
    <reference-type-def kind='rvalue' type-id='type-id-624' size-in-bits='64' id='type-id-991'/>
    <pointer-type-def type-id='type-id-624' size-in-bits='64' id='type-id-992'/>
    <reference-type-def kind='lvalue' type-id='type-id-993' size-in-bits='64' id='type-id-994'/>
    <pointer-type-def type-id='type-id-628' size-in-bits='64' id='type-id-995'/>
    <reference-type-def kind='rvalue' type-id='type-id-631' size-in-bits='64' id='type-id-996'/>
    <pointer-type-def type-id='type-id-631' size-in-bits='64' id='type-id-997'/>
    <reference-type-def kind='lvalue' type-id='type-id-634' size-in-bits='64' id='type-id-998'/>
    <pointer-type-def type-id='type-id-634' size-in-bits='64' id='type-id-999'/>
    <reference-type-def kind='lvalue' type-id='type-id-637' size-in-bits='64' id='type-id-1000'/>
    <pointer-type-def type-id='type-id-637' size-in-bits='64' id='type-id-1001'/>
    <reference-type-def kind='lvalue' type-id='type-id-640' size-in-bits='64' id='type-id-1002'/>
    <pointer-type-def type-id='type-id-640' size-in-bits='64' id='type-id-1003'/>
    <reference-type-def kind='lvalue' type-id='type-id-643' size-in-bits='64' id='type-id-1004'/>
    <pointer-type-def type-id='type-id-643' size-in-bits='64' id='type-id-1005'/>
    <reference-type-def kind='lvalue' type-id='type-id-647' size-in-bits='64' id='type-id-1006'/>
    <reference-type-def kind='rvalue' type-id='type-id-647' size-in-bits='64' id='type-id-1007'/>
    <pointer-type-def type-id='type-id-647' size-in-bits='64' id='type-id-1008'/>
    <reference-type-def kind='lvalue' type-id='type-id-651' size-in-bits='64' id='type-id-1009'/>
    <reference-type-def kind='rvalue' type-id='type-id-651' size-in-bits='64' id='type-id-1010'/>
    <pointer-type-def type-id='type-id-651' size-in-bits='64' id='type-id-1011'/>
    <reference-type-def kind='lvalue' type-id='type-id-655' size-in-bits='64' id='type-id-1012'/>
    <reference-type-def kind='rvalue' type-id='type-id-655' size-in-bits='64' id='type-id-1013'/>
    <pointer-type-def type-id='type-id-655' size-in-bits='64' id='type-id-1014'/>
    <reference-type-def kind='lvalue' type-id='type-id-659' size-in-bits='64' id='type-id-1015'/>
    <reference-type-def kind='rvalue' type-id='type-id-659' size-in-bits='64' id='type-id-1016'/>
    <pointer-type-def type-id='type-id-659' size-in-bits='64' id='type-id-1017'/>
    <pointer-type-def type-id='type-id-1018' size-in-bits='64' id='type-id-1019'/>
    <reference-type-def kind='lvalue' type-id='type-id-663' size-in-bits='64' id='type-id-1020'/>
    <reference-type-def kind='rvalue' type-id='type-id-663' size-in-bits='64' id='type-id-1021'/>
    <pointer-type-def type-id='type-id-663' size-in-bits='64' id='type-id-1022'/>
    <reference-type-def kind='lvalue' type-id='type-id-1023' size-in-bits='64' id='type-id-1024'/>
    <pointer-type-def type-id='type-id-1023' size-in-bits='64' id='type-id-1025'/>
    <pointer-type-def type-id='type-id-1026' size-in-bits='64' id='type-id-1027'/>
    <reference-type-def kind='lvalue' type-id='type-id-682' size-in-bits='64' id='type-id-1028'/>
    <pointer-type-def type-id='type-id-682' size-in-bits='64' id='type-id-1029'/>
    <reference-type-def kind='lvalue' type-id='type-id-685' size-in-bits='64' id='type-id-1030'/>
    <pointer-type-def type-id='type-id-685' size-in-bits='64' id='type-id-1031'/>
    <reference-type-def kind='lvalue' type-id='type-id-688' size-in-bits='64' id='type-id-1032'/>
    <pointer-type-def type-id='type-id-688' size-in-bits='64' id='type-id-1033'/>
    <reference-type-def kind='lvalue' type-id='type-id-691' size-in-bits='64' id='type-id-1034'/>
    <pointer-type-def type-id='type-id-691' size-in-bits='64' id='type-id-1035'/>
    <reference-type-def kind='lvalue' type-id='type-id-694' size-in-bits='64' id='type-id-1036'/>
    <pointer-type-def type-id='type-id-694' size-in-bits='64' id='type-id-1037'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-1038'/>
    <reference-type-def kind='lvalue' type-id='type-id-697' size-in-bits='64' id='type-id-1039'/>
    <reference-type-def kind='lvalue' type-id='type-id-700' size-in-bits='64' id='type-id-1040'/>
    <reference-type-def kind='lvalue' type-id='type-id-703' size-in-bits='64' id='type-id-1041'/>
    <pointer-type-def type-id='type-id-706' size-in-bits='64' id='type-id-1042'/>
    <reference-type-def kind='lvalue' type-id='type-id-709' size-in-bits='64' id='type-id-1043'/>
    <reference-type-def kind='rvalue' type-id='type-id-709' size-in-bits='64' id='type-id-1044'/>
    <pointer-type-def type-id='type-id-709' size-in-bits='64' id='type-id-1045'/>
    <reference-type-def kind='lvalue' type-id='type-id-1046' size-in-bits='64' id='type-id-1047'/>
    <pointer-type-def type-id='type-id-1046' size-in-bits='64' id='type-id-1048'/>
    <reference-type-def kind='lvalue' type-id='type-id-714' size-in-bits='64' id='type-id-1049'/>
    <pointer-type-def type-id='type-id-714' size-in-bits='64' id='type-id-1050'/>
    <pointer-type-def type-id='type-id-1051' size-in-bits='64' id='type-id-1052'/>
    <reference-type-def kind='lvalue' type-id='type-id-718' size-in-bits='64' id='type-id-1053'/>
    <reference-type-def kind='lvalue' type-id='type-id-721' size-in-bits='64' id='type-id-1054'/>
    <pointer-type-def type-id='type-id-721' size-in-bits='64' id='type-id-1055'/>
    <reference-type-def kind='lvalue' type-id='type-id-731' size-in-bits='64' id='type-id-1056'/>
    <pointer-type-def type-id='type-id-731' size-in-bits='64' id='type-id-1057'/>
    <reference-type-def kind='lvalue' type-id='type-id-738' size-in-bits='64' id='type-id-1058'/>
    <reference-type-def kind='lvalue' type-id='type-id-742' size-in-bits='64' id='type-id-1059'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-1060'/>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-1061'/>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-1062'/>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' id='type-id-1063'/>
    <pointer-type-def type-id='type-id-746' size-in-bits='64' id='type-id-1064'/>
    <pointer-type-def type-id='type-id-749' size-in-bits='64' id='type-id-1065'/>
    <pointer-type-def type-id='type-id-1066' size-in-bits='64' id='type-id-1067'/>
    <reference-type-def kind='lvalue' type-id='type-id-761' size-in-bits='64' id='type-id-1068'/>
    <reference-type-def kind='rvalue' type-id='type-id-761' size-in-bits='64' id='type-id-1069'/>
    <pointer-type-def type-id='type-id-761' size-in-bits='64' id='type-id-1070'/>
    <reference-type-def kind='lvalue' type-id='type-id-764' size-in-bits='64' id='type-id-1071'/>
    <reference-type-def kind='rvalue' type-id='type-id-764' size-in-bits='64' id='type-id-1072'/>
    <pointer-type-def type-id='type-id-764' size-in-bits='64' id='type-id-1073'/>
    <reference-type-def kind='lvalue' type-id='type-id-768' size-in-bits='64' id='type-id-1074'/>
    <reference-type-def kind='rvalue' type-id='type-id-768' size-in-bits='64' id='type-id-1075'/>
    <pointer-type-def type-id='type-id-768' size-in-bits='64' id='type-id-1076'/>
    <pointer-type-def type-id='type-id-771' size-in-bits='64' id='type-id-1077'/>
    <reference-type-def kind='lvalue' type-id='type-id-1078' size-in-bits='64' id='type-id-1079'/>
    <reference-type-def kind='lvalue' type-id='type-id-1080' size-in-bits='64' id='type-id-1081'/>
    <reference-type-def kind='lvalue' type-id='type-id-1082' size-in-bits='64' id='type-id-1083'/>
    <reference-type-def kind='lvalue' type-id='type-id-1084' size-in-bits='64' id='type-id-1085'/>
    <reference-type-def kind='lvalue' type-id='type-id-1086' size-in-bits='64' id='type-id-1087'/>
    <reference-type-def kind='lvalue' type-id='type-id-1088' size-in-bits='64' id='type-id-1089'/>
    <reference-type-def kind='lvalue' type-id='type-id-1090' size-in-bits='64' id='type-id-1091'/>
    <reference-type-def kind='lvalue' type-id='type-id-1092' size-in-bits='64' id='type-id-1093'/>
    <reference-type-def kind='lvalue' type-id='type-id-1094' size-in-bits='64' id='type-id-1095'/>
    <reference-type-def kind='lvalue' type-id='type-id-1096' size-in-bits='64' id='type-id-1097'/>
    <reference-type-def kind='lvalue' type-id='type-id-1098' size-in-bits='64' id='type-id-1099'/>
    <reference-type-def kind='lvalue' type-id='type-id-1100' size-in-bits='64' id='type-id-1101'/>
    <reference-type-def kind='rvalue' type-id='type-id-1102' size-in-bits='64' id='type-id-1103'/>
    <reference-type-def kind='lvalue' type-id='type-id-1104' size-in-bits='64' id='type-id-1105'/>
    <reference-type-def kind='lvalue' type-id='type-id-1106' size-in-bits='64' id='type-id-1107'/>
    <reference-type-def kind='lvalue' type-id='type-id-1108' size-in-bits='64' id='type-id-1109'/>
    <reference-type-def kind='lvalue' type-id='type-id-1110' size-in-bits='64' id='type-id-1111'/>
    <reference-type-def kind='lvalue' type-id='type-id-1112' size-in-bits='64' id='type-id-1113'/>
    <reference-type-def kind='lvalue' type-id='type-id-1114' size-in-bits='64' id='type-id-1115'/>
    <reference-type-def kind='rvalue' type-id='type-id-1116' size-in-bits='64' id='type-id-1117'/>
    <reference-type-def kind='rvalue' type-id='type-id-1118' size-in-bits='64' id='type-id-1119'/>
    <reference-type-def kind='lvalue' type-id='type-id-1120' size-in-bits='64' id='type-id-1121'/>
    <reference-type-def kind='rvalue' type-id='type-id-1120' size-in-bits='64' id='type-id-1122'/>
    <reference-type-def kind='rvalue' type-id='type-id-1123' size-in-bits='64' id='type-id-1124'/>
    <reference-type-def kind='lvalue' type-id='type-id-1125' size-in-bits='64' id='type-id-1126'/>
    <reference-type-def kind='rvalue' type-id='type-id-1127' size-in-bits='64' id='type-id-1128'/>
    <reference-type-def kind='lvalue' type-id='type-id-1129' size-in-bits='64' id='type-id-1130'/>
    <reference-type-def kind='lvalue' type-id='type-id-1131' size-in-bits='64' id='type-id-1132'/>
    <reference-type-def kind='lvalue' type-id='type-id-1133' size-in-bits='64' id='type-id-1134'/>
    <reference-type-def kind='lvalue' type-id='type-id-1135' size-in-bits='64' id='type-id-1136'/>
    <reference-type-def kind='lvalue' type-id='type-id-1137' size-in-bits='64' id='type-id-1138'/>
    <reference-type-def kind='lvalue' type-id='type-id-774' size-in-bits='64' id='type-id-1139'/>
    <reference-type-def kind='rvalue' type-id='type-id-774' size-in-bits='64' id='type-id-1140'/>
    <pointer-type-def type-id='type-id-774' size-in-bits='64' id='type-id-1141'/>
    <reference-type-def kind='lvalue' type-id='type-id-777' size-in-bits='64' id='type-id-1142'/>
    <reference-type-def kind='rvalue' type-id='type-id-777' size-in-bits='64' id='type-id-1143'/>
    <pointer-type-def type-id='type-id-777' size-in-bits='64' id='type-id-1144'/>
    <reference-type-def kind='lvalue' type-id='type-id-780' size-in-bits='64' id='type-id-1145'/>
    <reference-type-def kind='rvalue' type-id='type-id-780' size-in-bits='64' id='type-id-1146'/>
    <pointer-type-def type-id='type-id-780' size-in-bits='64' id='type-id-1147'/>
    <reference-type-def kind='lvalue' type-id='type-id-783' size-in-bits='64' id='type-id-1148'/>
    <reference-type-def kind='rvalue' type-id='type-id-783' size-in-bits='64' id='type-id-1149'/>
    <pointer-type-def type-id='type-id-783' size-in-bits='64' id='type-id-1150'/>
    <reference-type-def kind='lvalue' type-id='type-id-786' size-in-bits='64' id='type-id-1151'/>
    <reference-type-def kind='rvalue' type-id='type-id-786' size-in-bits='64' id='type-id-1152'/>
    <pointer-type-def type-id='type-id-786' size-in-bits='64' id='type-id-1153'/>
    <reference-type-def kind='lvalue' type-id='type-id-792' size-in-bits='64' id='type-id-1154'/>
    <reference-type-def kind='rvalue' type-id='type-id-792' size-in-bits='64' id='type-id-1155'/>
    <pointer-type-def type-id='type-id-792' size-in-bits='64' id='type-id-1156'/>
    <reference-type-def kind='lvalue' type-id='type-id-795' size-in-bits='64' id='type-id-1157'/>
    <reference-type-def kind='rvalue' type-id='type-id-795' size-in-bits='64' id='type-id-1158'/>
    <pointer-type-def type-id='type-id-795' size-in-bits='64' id='type-id-1159'/>
    <reference-type-def kind='lvalue' type-id='type-id-798' size-in-bits='64' id='type-id-1160'/>
    <reference-type-def kind='rvalue' type-id='type-id-798' size-in-bits='64' id='type-id-1161'/>
    <pointer-type-def type-id='type-id-798' size-in-bits='64' id='type-id-1162'/>
    <reference-type-def kind='lvalue' type-id='type-id-801' size-in-bits='64' id='type-id-1163'/>
    <reference-type-def kind='rvalue' type-id='type-id-801' size-in-bits='64' id='type-id-1164'/>
    <pointer-type-def type-id='type-id-801' size-in-bits='64' id='type-id-1165'/>
    <reference-type-def kind='lvalue' type-id='type-id-1166' size-in-bits='64' id='type-id-1167'/>
    <reference-type-def kind='lvalue' type-id='type-id-804' size-in-bits='64' id='type-id-1168'/>
    <reference-type-def kind='rvalue' type-id='type-id-804' size-in-bits='64' id='type-id-1169'/>
    <pointer-type-def type-id='type-id-804' size-in-bits='64' id='type-id-1170'/>
    <reference-type-def kind='lvalue' type-id='type-id-817' size-in-bits='64' id='type-id-1171'/>
    <reference-type-def kind='rvalue' type-id='type-id-531' size-in-bits='64' id='type-id-1172'/>
    <reference-type-def kind='lvalue' type-id='type-id-820' size-in-bits='64' id='type-id-290'/>
    <reference-type-def kind='rvalue' type-id='type-id-820' size-in-bits='64' id='type-id-1173'/>
    <pointer-type-def type-id='type-id-820' size-in-bits='64' id='type-id-1174'/>
    <reference-type-def kind='lvalue' type-id='type-id-828' size-in-bits='64' id='type-id-1175'/>
    <reference-type-def kind='lvalue' type-id='type-id-833' size-in-bits='64' id='type-id-1176'/>
    <reference-type-def kind='rvalue' type-id='type-id-833' size-in-bits='64' id='type-id-1177'/>
    <pointer-type-def type-id='type-id-833' size-in-bits='64' id='type-id-1178'/>
    <reference-type-def kind='lvalue' type-id='type-id-837' size-in-bits='64' id='type-id-1179'/>
    <pointer-type-def type-id='type-id-288' size-in-bits='64' id='type-id-1180'/>
    <qualified-type-def type-id='type-id-1180' const='yes' id='type-id-1181'/>
    <reference-type-def kind='lvalue' type-id='type-id-1181' size-in-bits='64' id='type-id-1182'/>
    <pointer-type-def type-id='type-id-323' size-in-bits='64' id='type-id-41'/>
    <pointer-type-def type-id='type-id-1183' size-in-bits='64' id='type-id-321'/>
    <pointer-type-def type-id='type-id-1184' size-in-bits='64' id='type-id-322'/>
    <pointer-type-def type-id='type-id-1185' size-in-bits='64' id='type-id-1186'/>
    <pointer-type-def type-id='type-id-1187' size-in-bits='64' id='type-id-320'/>
    <reference-type-def kind='lvalue' type-id='type-id-1188' size-in-bits='64' id='type-id-1189'/>
    <qualified-type-def type-id='type-id-1188' const='yes' id='type-id-1190'/>
    <reference-type-def kind='lvalue' type-id='type-id-1190' size-in-bits='64' id='type-id-1191'/>
    <qualified-type-def type-id='type-id-1192' const='yes' id='type-id-1193'/>
    <reference-type-def kind='lvalue' type-id='type-id-1193' size-in-bits='64' id='type-id-1194'/>
    <qualified-type-def type-id='type-id-1195' const='yes' id='type-id-1196'/>
    <reference-type-def kind='lvalue' type-id='type-id-1196' size-in-bits='64' id='type-id-1197'/>
    <qualified-type-def type-id='type-id-1198' const='yes' id='type-id-1199'/>
    <reference-type-def kind='lvalue' type-id='type-id-1199' size-in-bits='64' id='type-id-1200'/>
    <qualified-type-def type-id='type-id-1201' const='yes' id='type-id-1202'/>
    <reference-type-def kind='lvalue' type-id='type-id-1202' size-in-bits='64' id='type-id-1203'/>
    <qualified-type-def type-id='type-id-1204' const='yes' id='type-id-1205'/>
    <reference-type-def kind='lvalue' type-id='type-id-1205' size-in-bits='64' id='type-id-1206'/>
    <qualified-type-def type-id='type-id-1207' const='yes' id='type-id-1208'/>
    <reference-type-def kind='lvalue' type-id='type-id-1208' size-in-bits='64' id='type-id-1209'/>
    <qualified-type-def type-id='type-id-1210' const='yes' id='type-id-1211'/>
    <reference-type-def kind='lvalue' type-id='type-id-1211' size-in-bits='64' id='type-id-1212'/>
    <qualified-type-def type-id='type-id-1213' const='yes' id='type-id-1214'/>
    <reference-type-def kind='lvalue' type-id='type-id-1214' size-in-bits='64' id='type-id-1215'/>
    <qualified-type-def type-id='type-id-1216' const='yes' id='type-id-1217'/>
    <reference-type-def kind='lvalue' type-id='type-id-1217' size-in-bits='64' id='type-id-1218'/>
    <qualified-type-def type-id='type-id-1219' const='yes' id='type-id-1220'/>
    <reference-type-def kind='lvalue' type-id='type-id-1220' size-in-bits='64' id='type-id-1221'/>
    <qualified-type-def type-id='type-id-1222' const='yes' id='type-id-1223'/>
    <reference-type-def kind='lvalue' type-id='type-id-1223' size-in-bits='64' id='type-id-1224'/>
    <qualified-type-def type-id='type-id-1225' const='yes' id='type-id-1226'/>
    <reference-type-def kind='lvalue' type-id='type-id-1226' size-in-bits='64' id='type-id-1227'/>
    <qualified-type-def type-id='type-id-1228' const='yes' id='type-id-1229'/>
    <reference-type-def kind='lvalue' type-id='type-id-1229' size-in-bits='64' id='type-id-1230'/>
    <qualified-type-def type-id='type-id-1231' const='yes' id='type-id-1232'/>
    <reference-type-def kind='lvalue' type-id='type-id-1232' size-in-bits='64' id='type-id-1233'/>
    <qualified-type-def type-id='type-id-1234' const='yes' id='type-id-1235'/>
    <reference-type-def kind='lvalue' type-id='type-id-1235' size-in-bits='64' id='type-id-1236'/>
    <qualified-type-def type-id='type-id-1237' const='yes' id='type-id-1238'/>
    <qualified-type-def type-id='type-id-1239' const='yes' id='type-id-1240'/>
    <reference-type-def kind='lvalue' type-id='type-id-1238' size-in-bits='64' id='type-id-1241'/>
    <qualified-type-def type-id='type-id-1242' const='yes' id='type-id-1243'/>
    <reference-type-def kind='lvalue' type-id='type-id-1243' size-in-bits='64' id='type-id-1244'/>
    <pointer-type-def type-id='type-id-1243' size-in-bits='64' id='type-id-1245'/>
    <qualified-type-def type-id='type-id-1246' const='yes' id='type-id-1247'/>
    <qualified-type-def type-id='type-id-1248' const='yes' id='type-id-1249'/>
    <qualified-type-def type-id='type-id-1250' const='yes' id='type-id-1251'/>
    <reference-type-def kind='lvalue' type-id='type-id-1247' size-in-bits='64' id='type-id-1252'/>
    <pointer-type-def type-id='type-id-1247' size-in-bits='64' id='type-id-1253'/>
    <pointer-type-def type-id='type-id-1249' size-in-bits='64' id='type-id-1254'/>
    <pointer-type-def type-id='type-id-1251' size-in-bits='64' id='type-id-1255'/>
    <qualified-type-def type-id='type-id-1256' const='yes' id='type-id-1257'/>
    <reference-type-def kind='lvalue' type-id='type-id-1257' size-in-bits='64' id='type-id-1258'/>
    <qualified-type-def type-id='type-id-1259' const='yes' id='type-id-1260'/>
    <reference-type-def kind='lvalue' type-id='type-id-1260' size-in-bits='64' id='type-id-1261'/>
    <qualified-type-def type-id='type-id-1262' const='yes' id='type-id-1263'/>
    <reference-type-def kind='lvalue' type-id='type-id-1263' size-in-bits='64' id='type-id-1264'/>
    <qualified-type-def type-id='type-id-1265' const='yes' id='type-id-1266'/>
    <reference-type-def kind='lvalue' type-id='type-id-1266' size-in-bits='64' id='type-id-1267'/>
    <qualified-type-def type-id='type-id-1268' const='yes' id='type-id-1269'/>
    <reference-type-def kind='lvalue' type-id='type-id-1269' size-in-bits='64' id='type-id-1270'/>
    <qualified-type-def type-id='type-id-1271' const='yes' id='type-id-1272'/>
    <reference-type-def kind='lvalue' type-id='type-id-1272' size-in-bits='64' id='type-id-1273'/>
    <function-decl name='openassetio_v1_InfoDictionary_ctor' mangled-name='openassetio_v1_InfoDictionary_ctor' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openassetio_v1_InfoDictionary_ctor'>
      <parameter type-id='type-id-857' name='err'/>
      <parameter type-id='type-id-1274' name='out'/>
      <return type-id='type-id-293'/>
    </function-decl>
    <function-decl name='openassetio_v1_InfoDictionary_getBool' mangled-name='openassetio_v1_InfoDictionary_getBool' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openassetio_v1_InfoDictionary_getBool'>
      <parameter type-id='type-id-857' name='err'/>
      <parameter type-id='type-id-851' name='out'/>
      <parameter type-id='type-id-1275' name='handle'/>
      <parameter type-id='type-id-425' name='key'/>
      <return type-id='type-id-293'/>
    </function-decl>
    <function-decl name='openassetio_v1_InfoDictionary_getFloat' mangled-name='openassetio_v1_InfoDictionary_getFloat' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openassetio_v1_InfoDictionary_getFloat'>
      <parameter type-id='type-id-857' name='err'/>
      <parameter type-id='type-id-852' name='out'/>
      <parameter type-id='type-id-1275' name='handle'/>
      <parameter type-id='type-id-425' name='key'/>
      <return type-id='type-id-293'/>
    </function-decl>
    <function-decl name='openassetio_v1_InfoDictionary_getInt' mangled-name='openassetio_v1_InfoDictionary_getInt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openassetio_v1_InfoDictionary_getInt'>
      <parameter type-id='type-id-857' name='err'/>
      <parameter type-id='type-id-853' name='out'/>
      <parameter type-id='type-id-1275' name='handle'/>
      <parameter type-id='type-id-425' name='key'/>
      <return type-id='type-id-293'/>
    </function-decl>
    <function-decl name='openassetio_v1_InfoDictionary_getStr' mangled-name='openassetio_v1_InfoDictionary_getStr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openassetio_v1_InfoDictionary_getStr'>
      <parameter type-id='type-id-857' name='err'/>
      <parameter type-id='type-id-857' name='out'/>
      <parameter type-id='type-id-1275' name='handle'/>
      <parameter type-id='type-id-425' name='key'/>
      <return type-id='type-id-293'/>
    </function-decl>
    <function-decl name='openassetio_v1_InfoDictionary_setBool' mangled-name='openassetio_v1_InfoDictionary_setBool' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openassetio_v1_InfoDictionary_setBool'>
      <parameter type-id='type-id-857' name='err'/>
      <parameter type-id='type-id-1275' name='handle'/>
      <parameter type-id='type-id-425' name='key'/>
      <parameter type-id='type-id-399' name='value'/>
      <return type-id='type-id-293'/>
    </function-decl>
    <function-decl name='openassetio_v1_InfoDictionary_setFloat' mangled-name='openassetio_v1_InfoDictionary_setFloat' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openassetio_v1_InfoDictionary_setFloat'>
      <parameter type-id='type-id-857' name='err'/>
      <parameter type-id='type-id-1275' name='handle'/>
      <parameter type-id='type-id-425' name='key'/>
      <parameter type-id='type-id-401' name='value'/>
      <return type-id='type-id-293'/>
    </function-decl>
    <function-decl name='openassetio_v1_InfoDictionary_setInt' mangled-name='openassetio_v1_InfoDictionary_setInt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openassetio_v1_InfoDictionary_setInt'>
      <parameter type-id='type-id-857' name='err'/>
      <parameter type-id='type-id-1275' name='handle'/>
      <parameter type-id='type-id-425' name='key'/>
      <parameter type-id='type-id-403' name='value'/>
      <return type-id='type-id-293'/>
    </function-decl>
    <function-decl name='openassetio_v1_InfoDictionary_setStr' mangled-name='openassetio_v1_InfoDictionary_setStr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openassetio_v1_InfoDictionary_setStr'>
      <parameter type-id='type-id-857' name='err'/>
      <parameter type-id='type-id-1275' name='handle'/>
      <parameter type-id='type-id-425' name='key'/>
      <parameter type-id='type-id-425' name='value'/>
      <return type-id='type-id-293'/>
    </function-decl>
    <function-decl name='openassetio_v1_InfoDictionary_typeOf' mangled-name='openassetio_v1_InfoDictionary_typeOf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openassetio_v1_InfoDictionary_typeOf'>
      <parameter type-id='type-id-857' name='err'/>
      <parameter type-id='type-id-856' name='out'/>
      <parameter type-id='type-id-1275' name='handle'/>
      <parameter type-id='type-id-425' name='key'/>
      <return type-id='type-id-293'/>
    </function-decl>
    <function-decl name='openassetio_v1_hostApi_Manager_ctor' mangled-name='openassetio_v1_hostApi_Manager_ctor' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openassetio_v1_hostApi_Manager_ctor'>
      <parameter type-id='type-id-857' name='err'/>
      <parameter type-id='type-id-1276' name='handle'/>
      <parameter type-id='type-id-1277' name='managerInterfaceHandle'/>
      <parameter type-id='type-id-1278' name='hostSessionHandle'/>
      <return type-id='type-id-293'/>
    </function-decl>
    <function-decl name='openassetio_v1_hostApi_Manager_displayName' mangled-name='openassetio_v1_hostApi_Manager_displayName' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openassetio_v1_hostApi_Manager_displayName'>
      <parameter type-id='type-id-857' name='err'/>
      <parameter type-id='type-id-857' name='out'/>
      <parameter type-id='type-id-1279' name='handle'/>
      <return type-id='type-id-293'/>
    </function-decl>
    <function-decl name='openassetio_v1_hostApi_Manager_identifier' mangled-name='openassetio_v1_hostApi_Manager_identifier' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openassetio_v1_hostApi_Manager_identifier'>
      <parameter type-id='type-id-857' name='err'/>
      <parameter type-id='type-id-857' name='out'/>
      <parameter type-id='type-id-1279' name='handle'/>
      <return type-id='type-id-293'/>
    </function-decl>
    <function-decl name='openassetio_v1_hostApi_Manager_info' mangled-name='openassetio_v1_hostApi_Manager_info' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openassetio_v1_hostApi_Manager_info'>
      <parameter type-id='type-id-857' name='err'/>
      <parameter type-id='type-id-1280' name='out'/>
      <parameter type-id='type-id-1279' name='handle'/>
      <return type-id='type-id-293'/>
    </function-decl>
    <function-decl name='openassetio_v1_InfoDictionary_size' mangled-name='openassetio_v1_InfoDictionary_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openassetio_v1_InfoDictionary_size'>
      <parameter type-id='type-id-1275' name='handle'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='oa_hostApi_Manager_dtor' mangled-name='oa_hostApi_Manager_dtor' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='oa_hostApi_Manager_dtor'>
      <parameter type-id='type-id-1279' name='handle'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='openassetio_v1_InfoDictionary_dtor' mangled-name='openassetio_v1_InfoDictionary_dtor' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openassetio_v1_InfoDictionary_dtor'>
      <parameter type-id='type-id-1275' name='handle'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <namespace-decl name='std'>
      <class-decl name='_Hashtable&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;, std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;, std::variant&lt;bool, long int, double, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;, std::allocator&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;, std::variant&lt;bool, long int, double, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt; &gt;, std::__detail::_Select1st, std::equal_to&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;, std::hash&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;, std::__detail::_Mod_range_hashing, std::__detail::_Default_ranged_hash, std::__detail::_Prime_rehash_policy, std::__detail::_Hashtable_traits&lt;true, false, true&gt; &gt;' size-in-bits='448' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='173' column='1' id='type-id-431'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-513'/>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-534'/>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1281'/>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-561'/>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-487'/>
        <base-class access='private' layout-offset-in-bits='0' type-id='type-id-506'/>
        <member-type access='private'>
          <typedef-decl name='__bucket_type' type-id='type-id-923' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='208' column='1' id='type-id-866'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='__hash_code' type-id='type-id-1283' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='240' column='1' id='type-id-1282'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='__hashtable_alloc' type-id='type-id-506' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='201' column='1' id='type-id-868'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='__node_base' type-id='type-id-926' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='207' column='1' id='type-id-870'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='__rehash_state' type-id='type-id-1284' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='225' column='1' id='type-id-435'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='allocator_type' type-id='type-id-691' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='213' column='1' id='type-id-438'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='key_equal' type-id='type-id-738' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='214' column='1' id='type-id-441'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_local_iterator' type-id='type-id-1286' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='318' column='1' id='type-id-1285'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_local_iterator' type-id='type-id-1288' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='318' column='1' id='type-id-1287'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_local_iterator' type-id='type-id-1290' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='318' column='1' id='type-id-1289'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='insert_return_type' type-id='type-id-1292' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='323' column='1' id='type-id-1291'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='insert_return_type' type-id='type-id-1294' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='323' column='1' id='type-id-1293'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='insert_return_type' type-id='type-id-1296' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='323' column='1' id='type-id-1295'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='local_iterator' type-id='type-id-1298' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='317' column='1' id='type-id-1297'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='local_iterator' type-id='type-id-1300' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='317' column='1' id='type-id-1299'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='local_iterator' type-id='type-id-1302' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='317' column='1' id='type-id-1301'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='node_type' type-id='type-id-1304' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='322' column='1' id='type-id-1303'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='node_type' type-id='type-id-1306' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='322' column='1' id='type-id-1305'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='node_type' type-id='type-id-1308' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='322' column='1' id='type-id-1307'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_buckets' type-id='type-id-867' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='327' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_bucket_count' type-id='type-id-302' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='328' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='_M_before_begin' type-id='type-id-870' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='329' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='_M_element_count' type-id='type-id-302' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='330' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='256'>
          <var-decl name='_M_rehash_policy' type-id='type-id-557' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='331' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='384'>
          <var-decl name='_M_single_bucket' type-id='type-id-866' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='339' column='1'/>
        </data-member>
        <member-function access='public' destructor='yes'>
          <function-decl name='~_Hashtable' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEED4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='1348' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~_Hashtable' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEED2Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='1348' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator=' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEEaSEOSH_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='473' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <parameter type-id='type-id-864'/>
            <return type-id='type-id-863'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='clear' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE5clearEv' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='2024' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='_M_deallocate_buckets' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE21_M_deallocate_bucketsEv' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='374' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='_M_move_assign' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE14_M_move_assignEOSH_St17integral_constantIbLb1EE' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='1176' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <parameter type-id='type-id-864'/>
            <parameter type-id='type-id-1309'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='private' const='yes'>
          <function-decl name='_M_begin' mangled-name='_ZNKSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE8_M_beginEv' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='383' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-434' is-artificial='yes'/>
            <return type-id='type-id-910'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='_M_deallocate_buckets' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE21_M_deallocate_bucketsEPPNS6_15_Hash_node_baseEm' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='365' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <parameter type-id='type-id-867'/>
            <parameter type-id='type-id-302'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='private' const='yes'>
          <function-decl name='_M_uses_single_bucket' mangled-name='_ZNKSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE21_M_uses_single_bucketEv' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='346' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-434' is-artificial='yes'/>
            <return type-id='type-id-292'/>
          </function-decl>
        </member-function>
        <member-function access='protected' const='yes'>
          <function-decl name='_M_bucket_index' mangled-name='_ZNKSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE15_M_bucket_indexEPNS6_10_Hash_nodeIS4_Lb1EEE' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='639' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-434' is-artificial='yes'/>
            <parameter type-id='type-id-910'/>
            <return type-id='type-id-302'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='_M_reset' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE8_M_resetEv' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='1159' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='private' const='yes'>
          <function-decl name='_M_uses_single_bucket' mangled-name='_ZNKSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE21_M_uses_single_bucketEPPNS6_15_Hash_node_baseE' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-434' is-artificial='yes'/>
            <parameter type-id='type-id-867'/>
            <return type-id='type-id-292'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_Hashtable' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEEC4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='414' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_Hashtable' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEEC2Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='414' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='size' mangled-name='_ZNKSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE4sizeEv' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='528' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-434' is-artificial='yes'/>
            <return type-id='type-id-302'/>
          </function-decl>
        </member-function>
        <member-function access='protected' const='yes'>
          <function-decl name='_M_bucket_index' mangled-name='_ZNKSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE15_M_bucket_indexERS1_m' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='643' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-434' is-artificial='yes'/>
            <parameter type-id='type-id-446'/>
            <parameter type-id='type-id-1282'/>
            <return type-id='type-id-302'/>
          </function-decl>
        </member-function>
        <member-function access='protected' const='yes'>
          <function-decl name='_M_find_node' mangled-name='_ZNKSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE12_M_find_nodeEmRS1_m' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='652' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-434' is-artificial='yes'/>
            <parameter type-id='type-id-302'/>
            <parameter type-id='type-id-446'/>
            <parameter type-id='type-id-1282'/>
            <return type-id='type-id-910'/>
          </function-decl>
        </member-function>
        <member-function access='protected' const='yes'>
          <function-decl name='_M_find_before_node' mangled-name='_ZNKSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE19_M_find_before_nodeEmRS1_m' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='1532' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-434' is-artificial='yes'/>
            <parameter type-id='type-id-302'/>
            <parameter type-id='type-id-446'/>
            <parameter type-id='type-id-1282'/>
            <return type-id='type-id-871'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='find' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE4findERS1_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='1412' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <parameter type-id='type-id-446'/>
            <return type-id='type-id-1310'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='end' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE3endEv' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='512' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <return type-id='type-id-1310'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='emplace&lt;const std::piecewise_construct_t&amp;, std::tuple&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;&amp;&amp;&gt;, std::tuple&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;&amp;&amp;&gt; &gt;' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE7emplaceIJRKSt21piecewise_construct_tSt5tupleIJOSsEESO_EEES0_INS6_14_Node_iteratorIS4_Lb0ELb1EEEbEDpOT_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='748' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <parameter type-id='type-id-773'/>
            <parameter type-id='type-id-1164'/>
            <parameter type-id='type-id-1164'/>
            <return type-id='type-id-1311'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='emplace&lt;const std::piecewise_construct_t&amp;, std::tuple&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;&amp;&amp;&gt;, std::tuple&lt;bool&amp;&amp;&gt; &gt;' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE7emplaceIJRKSt21piecewise_construct_tSt5tupleIJOSsEESM_IJObEEEEES0_INS6_14_Node_iteratorIS4_Lb0ELb1EEEbEDpOT_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='748' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <parameter type-id='type-id-773'/>
            <parameter type-id='type-id-1164'/>
            <parameter type-id='type-id-1155'/>
            <return type-id='type-id-1311'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='emplace&lt;const std::piecewise_construct_t&amp;, std::tuple&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;&amp;&amp;&gt;, std::tuple&lt;long int&amp;&amp;&gt; &gt;' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE7emplaceIJRKSt21piecewise_construct_tSt5tupleIJOSsEESM_IJOlEEEEES0_INS6_14_Node_iteratorIS4_Lb0ELb1EEEbEDpOT_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='748' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <parameter type-id='type-id-773'/>
            <parameter type-id='type-id-1164'/>
            <parameter type-id='type-id-1161'/>
            <return type-id='type-id-1311'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='emplace&lt;const std::piecewise_construct_t&amp;, std::tuple&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;&amp;&amp;&gt;, std::tuple&lt;double&amp;&amp;&gt; &gt;' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE7emplaceIJRKSt21piecewise_construct_tSt5tupleIJOSsEESM_IJOdEEEEES0_INS6_14_Node_iteratorIS4_Lb0ELb1EEEbEDpOT_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='748' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <parameter type-id='type-id-773'/>
            <parameter type-id='type-id-1164'/>
            <parameter type-id='type-id-1158'/>
            <return type-id='type-id-1311'/>
          </function-decl>
        </member-function>
        <member-function access='protected'>
          <function-decl name='_M_emplace&lt;const std::piecewise_construct_t&amp;, std::tuple&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;&amp;&amp;&gt;, std::tuple&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;&amp;&amp;&gt; &gt;' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE10_M_emplaceIJRKSt21piecewise_construct_tSt5tupleIJOSsEESO_EEES0_INS6_14_Node_iteratorIS4_Lb0ELb1EEEbESt17integral_constantIbLb1EEDpOT_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='1632' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <parameter type-id='type-id-1309'/>
            <parameter type-id='type-id-773'/>
            <parameter type-id='type-id-1164'/>
            <parameter type-id='type-id-1164'/>
            <return type-id='type-id-768'/>
          </function-decl>
        </member-function>
        <member-function access='protected'>
          <function-decl name='_M_emplace&lt;const std::piecewise_construct_t&amp;, std::tuple&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;&amp;&amp;&gt;, std::tuple&lt;bool&amp;&amp;&gt; &gt;' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE10_M_emplaceIJRKSt21piecewise_construct_tSt5tupleIJOSsEESM_IJObEEEEES0_INS6_14_Node_iteratorIS4_Lb0ELb1EEEbESt17integral_constantIbLb1EEDpOT_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='1632' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <parameter type-id='type-id-1309'/>
            <parameter type-id='type-id-773'/>
            <parameter type-id='type-id-1164'/>
            <parameter type-id='type-id-1155'/>
            <return type-id='type-id-768'/>
          </function-decl>
        </member-function>
        <member-function access='protected'>
          <function-decl name='_M_emplace&lt;const std::piecewise_construct_t&amp;, std::tuple&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;&amp;&amp;&gt;, std::tuple&lt;long int&amp;&amp;&gt; &gt;' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE10_M_emplaceIJRKSt21piecewise_construct_tSt5tupleIJOSsEESM_IJOlEEEEES0_INS6_14_Node_iteratorIS4_Lb0ELb1EEEbESt17integral_constantIbLb1EEDpOT_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='1632' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <parameter type-id='type-id-1309'/>
            <parameter type-id='type-id-773'/>
            <parameter type-id='type-id-1164'/>
            <parameter type-id='type-id-1161'/>
            <return type-id='type-id-768'/>
          </function-decl>
        </member-function>
        <member-function access='protected'>
          <function-decl name='_M_emplace&lt;const std::piecewise_construct_t&amp;, std::tuple&lt;std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;&amp;&amp;&gt;, std::tuple&lt;double&amp;&amp;&gt; &gt;' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE10_M_emplaceIJRKSt21piecewise_construct_tSt5tupleIJOSsEESM_IJOdEEEEES0_INS6_14_Node_iteratorIS4_Lb0ELb1EEEbESt17integral_constantIbLb1EEDpOT_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='1632' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <parameter type-id='type-id-1309'/>
            <parameter type-id='type-id-773'/>
            <parameter type-id='type-id-1164'/>
            <parameter type-id='type-id-1158'/>
            <return type-id='type-id-768'/>
          </function-decl>
        </member-function>
        <member-function access='protected'>
          <function-decl name='_M_insert_unique_node' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE21_M_insert_unique_nodeEmmPNS6_10_Hash_nodeIS4_Lb1EEEm' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='1698' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <parameter type-id='type-id-302'/>
            <parameter type-id='type-id-1282'/>
            <parameter type-id='type-id-910'/>
            <parameter type-id='type-id-302'/>
            <return type-id='type-id-1310'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='_M_rehash' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE9_M_rehashEmRKm' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='2061' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <parameter type-id='type-id-302'/>
            <parameter type-id='type-id-437'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='protected'>
          <function-decl name='_M_insert_bucket_begin' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE22_M_insert_bucket_beginEmPNS6_10_Hash_nodeIS4_Lb1EEE' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='1560' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <parameter type-id='type-id-302'/>
            <parameter type-id='type-id-910'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='_M_rehash_aux' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE13_M_rehash_auxEmSt17integral_constantIbLb1EE' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='2084' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <parameter type-id='type-id-302'/>
            <parameter type-id='type-id-1309'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='_M_allocate_buckets' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEE19_M_allocate_bucketsEm' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <parameter type-id='type-id-302'/>
            <return type-id='type-id-867'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~_Hashtable' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEED4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='1348' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_Hashtable' mangled-name='_ZNSt10_HashtableISsSt4pairIKSsSt7variantIJbldSsEEESaIS4_ENSt8__detail10_Select1stESt8equal_toISsESt4hashISsENS6_18_Mod_range_hashingENS6_20_Default_ranged_hashENS6_20_Prime_rehash_policyENS6_17_Hashtable_traitsILb1ELb0ELb1EEEEC4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/hashtable.h' line='414' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-865' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='_Mutex_base&lt;(__gnu_cxx::_Lock_policy)2&gt;' size-in-bits='8' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='94' column='1' id='type-id-1312'>
        <member-type access='protected'>
          <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='98' column='1' id='type-id-1313'>
            <underlying-type type-id='type-id-295'/>
            <enumerator name='_S_need_barriers' value='0'/>
          </enum-decl>
        </member-type>
      </class-decl>
      <class-decl name='_Sp_counted_base&lt;(__gnu_cxx::_Lock_policy)2&gt;' size-in-bits='128' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='113' column='1' id='type-id-459'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1312'/>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_use_count' type-id='type-id-324' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='210' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='96'>
          <var-decl name='_M_weak_count' type-id='type-id-324' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='211' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='_M_add_ref_copy' mangled-name='_ZNSt16_Sp_counted_baseILN9__gnu_cxx12_Lock_policyE2EE15_M_add_ref_copyEv' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-885' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_M_release' mangled-name='_ZNSt16_Sp_counted_baseILN9__gnu_cxx12_Lock_policyE2EE10_M_releaseEv' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-885' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='-1'>
          <function-decl name='~_Sp_counted_base' mangled-name='_ZNSt16_Sp_counted_baseILN9__gnu_cxx12_Lock_policyE2EED4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='121' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-885' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='2'>
          <function-decl name='_M_dispose' mangled-name='_ZNSt16_Sp_counted_baseILN9__gnu_cxx12_Lock_policyE2EE10_M_disposeEv' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-885' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='3'>
          <function-decl name='_M_destroy' mangled-name='_ZNSt16_Sp_counted_baseILN9__gnu_cxx12_Lock_policyE2EE10_M_destroyEv' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-885' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='4'>
          <function-decl name='_M_get_deleter' mangled-name='_ZNSt16_Sp_counted_baseILN9__gnu_cxx12_Lock_policyE2EE14_M_get_deleterERKSt9type_info' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-885' is-artificial='yes'/>
            <parameter type-id='type-id-1252'/>
            <return type-id='type-id-14'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__make_unsigned_selector_base' size-in-bits='8' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/type_traits' line='1609' column='1' id='type-id-1314'>
        <member-type access='protected'>
          <class-decl name='_List&lt;&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/type_traits' line='1612' column='1' id='type-id-1315'/>
        </member-type>
        <member-type access='protected'>
          <class-decl name='_List&lt;long long unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/type_traits' line='1615' column='1' id='type-id-1316'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1315'/>
            <data-member access='public' static='yes'>
              <var-decl name='__size' type-id='type-id-314' mangled-name='_ZNSt29__make_unsigned_selector_base5_ListIJyEE6__sizeE' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/type_traits' line='1616' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='protected'>
          <class-decl name='_List&lt;long unsigned int, long long unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/type_traits' line='1615' column='1' id='type-id-1317'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1316'/>
            <data-member access='public' static='yes'>
              <var-decl name='__size' type-id='type-id-314' mangled-name='_ZNSt29__make_unsigned_selector_base5_ListIJmyEE6__sizeE' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/type_traits' line='1616' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='protected'>
          <class-decl name='_List&lt;short unsigned int, unsigned int, long unsigned int, long long unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/type_traits' line='1615' column='1' id='type-id-1318'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1319'/>
            <data-member access='public' static='yes'>
              <var-decl name='__size' type-id='type-id-314' mangled-name='_ZNSt29__make_unsigned_selector_base5_ListIJtjmyEE6__sizeE' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/type_traits' line='1616' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='protected'>
          <class-decl name='_List&lt;unsigned char, short unsigned int, unsigned int, long unsigned int, long long unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/type_traits' line='1615' column='1' id='type-id-1320'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1318'/>
            <data-member access='public' static='yes'>
              <var-decl name='__size' type-id='type-id-314' mangled-name='_ZNSt29__make_unsigned_selector_base5_ListIJhtjmyEE6__sizeE' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/type_traits' line='1616' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='protected'>
          <class-decl name='_List&lt;unsigned int, long unsigned int, long long unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/type_traits' line='1615' column='1' id='type-id-1319'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1317'/>
            <data-member access='public' static='yes'>
              <var-decl name='__size' type-id='type-id-314' mangled-name='_ZNSt29__make_unsigned_selector_base5_ListIJjmyEE6__sizeE' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/type_traits' line='1616' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
      </class-decl>
      <class-decl name='__pair_base&lt;bool, long unsigned int&gt;' size-in-bits='8' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/stl_pair.h' line='190' column='1' id='type-id-634'/>
      <class-decl name='__pair_base&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;, std::variant&lt;bool, long int, double, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;' size-in-bits='8' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/stl_pair.h' line='190' column='1' id='type-id-637'/>
      <class-decl name='__shared_count&lt;(__gnu_cxx::_Lock_policy)2&gt;' size-in-bits='64' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='607' column='1' id='type-id-643'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_pi' type-id='type-id-885' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='791' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='__shared_count' mangled-name='_ZNSt14__shared_countILN9__gnu_cxx12_Lock_policyE2EEC4ERKS2_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='733' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1005' is-artificial='yes'/>
            <parameter type-id='type-id-645'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='__shared_count' mangled-name='_ZNSt14__shared_countILN9__gnu_cxx12_Lock_policyE2EEC2ERKS2_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='733' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1005' is-artificial='yes'/>
            <parameter type-id='type-id-645'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~__shared_count' mangled-name='_ZNSt14__shared_countILN9__gnu_cxx12_Lock_policyE2EED4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='727' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1005' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~__shared_count' mangled-name='_ZNSt14__shared_countILN9__gnu_cxx12_Lock_policyE2EED2Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='727' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1005' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='__shared_count' mangled-name='_ZNSt14__shared_countILN9__gnu_cxx12_Lock_policyE2EEC4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='616' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1005' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='__shared_count' mangled-name='_ZNSt14__shared_countILN9__gnu_cxx12_Lock_policyE2EEC2Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='616' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1005' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='_M_swap' mangled-name='_ZNSt14__shared_countILN9__gnu_cxx12_Lock_policyE2EE7_M_swapERS2_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='756' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1005' is-artificial='yes'/>
            <parameter type-id='type-id-1004'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__shared_ptr&lt;openassetio::v1::hostApi::Manager, (__gnu_cxx::_Lock_policy)2&gt;' size-in-bits='128' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1080' column='1' id='type-id-647'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-667'/>
        <member-type access='public'>
          <typedef-decl name='element_type' type-id='type-id-1322' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1084' column='1' id='type-id-1321'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_ptr' type-id='type-id-1323' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1404' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_refcount' type-id='type-id-643' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1405' column='1'/>
        </data-member>
        <member-function access='public' destructor='yes'>
          <function-decl name='~__shared_ptr' mangled-name='_ZNSt12__shared_ptrIN11openassetio2v17hostApi7ManagerELN9__gnu_cxx12_Lock_policyE2EED4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1169' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1008' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~__shared_ptr' mangled-name='_ZNSt12__shared_ptrIN11openassetio2v17hostApi7ManagerELN9__gnu_cxx12_Lock_policyE2EED2Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1169' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1008' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='__shared_ptr' mangled-name='_ZNSt12__shared_ptrIN11openassetio2v17hostApi7ManagerELN9__gnu_cxx12_Lock_policyE2EEC4ERKS6_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1167' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1008' is-artificial='yes'/>
            <parameter type-id='type-id-649'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='__shared_ptr' mangled-name='_ZNSt12__shared_ptrIN11openassetio2v17hostApi7ManagerELN9__gnu_cxx12_Lock_policyE2EEC2ERKS6_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1167' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1008' is-artificial='yes'/>
            <parameter type-id='type-id-649'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='__shared_ptr' mangled-name='_ZNSt12__shared_ptrIN11openassetio2v17hostApi7ManagerELN9__gnu_cxx12_Lock_policyE2EEC4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1118' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1008' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='__shared_ptr' mangled-name='_ZNSt12__shared_ptrIN11openassetio2v17hostApi7ManagerELN9__gnu_cxx12_Lock_policyE2EEC2Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1118' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1008' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator=' mangled-name='_ZNSt12__shared_ptrIN11openassetio2v17hostApi7ManagerELN9__gnu_cxx12_Lock_policyE2EEaSEOS6_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1263' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1008' is-artificial='yes'/>
            <parameter type-id='type-id-1007'/>
            <return type-id='type-id-1006'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='__shared_ptr' mangled-name='_ZNSt12__shared_ptrIN11openassetio2v17hostApi7ManagerELN9__gnu_cxx12_Lock_policyE2EEC4EOS6_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1176' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1008' is-artificial='yes'/>
            <parameter type-id='type-id-1007'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='__shared_ptr' mangled-name='_ZNSt12__shared_ptrIN11openassetio2v17hostApi7ManagerELN9__gnu_cxx12_Lock_policyE2EEC2EOS6_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1176' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1008' is-artificial='yes'/>
            <parameter type-id='type-id-1007'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='swap' mangled-name='_ZNSt12__shared_ptrIN11openassetio2v17hostApi7ManagerELN9__gnu_cxx12_Lock_policyE2EE4swapERS6_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1324' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1008' is-artificial='yes'/>
            <parameter type-id='type-id-1006'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='get' mangled-name='_ZNKSt12__shared_ptrIN11openassetio2v17hostApi7ManagerELN9__gnu_cxx12_Lock_policyE2EE3getEv' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1309' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-650' is-artificial='yes'/>
            <return type-id='type-id-1323'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__shared_ptr&lt;openassetio::v1::log::LoggerInterface, (__gnu_cxx::_Lock_policy)2&gt;' size-in-bits='128' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1080' column='1' id='type-id-651'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-670'/>
        <member-type access='public'>
          <typedef-decl name='element_type' type-id='type-id-1325' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1084' column='1' id='type-id-1324'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_ptr' type-id='type-id-1326' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1404' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_refcount' type-id='type-id-643' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1405' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__shared_ptr&lt;openassetio::v1::managerApi::Host, (__gnu_cxx::_Lock_policy)2&gt;' size-in-bits='128' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1080' column='1' id='type-id-655'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-673'/>
        <member-type access='public'>
          <typedef-decl name='element_type' type-id='type-id-1328' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1084' column='1' id='type-id-1327'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_ptr' type-id='type-id-1329' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1404' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_refcount' type-id='type-id-643' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1405' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__shared_ptr&lt;openassetio::v1::managerApi::HostSession, (__gnu_cxx::_Lock_policy)2&gt;' size-in-bits='128' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1080' column='1' id='type-id-659'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-676'/>
        <member-type access='public'>
          <typedef-decl name='element_type' type-id='type-id-1330' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1084' column='1' id='type-id-1018'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_ptr' type-id='type-id-1019' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1404' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_refcount' type-id='type-id-643' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1405' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='__shared_ptr' mangled-name='_ZNSt12__shared_ptrIN11openassetio2v110managerApi11HostSessionELN9__gnu_cxx12_Lock_policyE2EEC4ERKS6_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1167' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1017' is-artificial='yes'/>
            <parameter type-id='type-id-661'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='__shared_ptr' mangled-name='_ZNSt12__shared_ptrIN11openassetio2v110managerApi11HostSessionELN9__gnu_cxx12_Lock_policyE2EEC2ERKS6_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1167' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1017' is-artificial='yes'/>
            <parameter type-id='type-id-661'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~__shared_ptr' mangled-name='_ZNSt12__shared_ptrIN11openassetio2v110managerApi11HostSessionELN9__gnu_cxx12_Lock_policyE2EED4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1169' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1017' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~__shared_ptr' mangled-name='_ZNSt12__shared_ptrIN11openassetio2v110managerApi11HostSessionELN9__gnu_cxx12_Lock_policyE2EED2Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1169' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1017' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__shared_ptr&lt;openassetio::v1::managerApi::ManagerInterface, (__gnu_cxx::_Lock_policy)2&gt;' size-in-bits='128' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1080' column='1' id='type-id-663'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-679'/>
        <member-type access='public'>
          <typedef-decl name='element_type' type-id='type-id-1332' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1084' column='1' id='type-id-1331'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_ptr' type-id='type-id-1333' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1404' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_refcount' type-id='type-id-643' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1405' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='__shared_ptr' mangled-name='_ZNSt12__shared_ptrIN11openassetio2v110managerApi16ManagerInterfaceELN9__gnu_cxx12_Lock_policyE2EEC4ERKS6_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1167' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1022' is-artificial='yes'/>
            <parameter type-id='type-id-665'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='__shared_ptr' mangled-name='_ZNSt12__shared_ptrIN11openassetio2v110managerApi16ManagerInterfaceELN9__gnu_cxx12_Lock_policyE2EEC2ERKS6_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1167' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1022' is-artificial='yes'/>
            <parameter type-id='type-id-665'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~__shared_ptr' mangled-name='_ZNSt12__shared_ptrIN11openassetio2v110managerApi16ManagerInterfaceELN9__gnu_cxx12_Lock_policyE2EED4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1169' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1022' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~__shared_ptr' mangled-name='_ZNSt12__shared_ptrIN11openassetio2v110managerApi16ManagerInterfaceELN9__gnu_cxx12_Lock_policyE2EED2Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1169' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1022' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__shared_ptr_access&lt;openassetio::v1::hostApi::Manager, (__gnu_cxx::_Lock_policy)2, false, false&gt;' size-in-bits='8' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='999' column='1' id='type-id-667'>
        <member-type access='public'>
          <typedef-decl name='element_type' type-id='type-id-1335' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1002' column='1' id='type-id-1334'/>
        </member-type>
        <member-function access='public' const='yes'>
          <function-decl name='operator-&gt;' mangled-name='_ZNKSt19__shared_ptr_accessIN11openassetio2v17hostApi7ManagerELN9__gnu_cxx12_Lock_policyE2ELb0ELb0EEptEv' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1012' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-669' is-artificial='yes'/>
            <return type-id='type-id-1336'/>
          </function-decl>
        </member-function>
        <member-function access='private' const='yes'>
          <function-decl name='_M_get' mangled-name='_ZNKSt19__shared_ptr_accessIN11openassetio2v17hostApi7ManagerELN9__gnu_cxx12_Lock_policyE2ELb0ELb0EE6_M_getEv' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1020' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-669' is-artificial='yes'/>
            <return type-id='type-id-1336'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='__shared_ptr_access&lt;openassetio::v1::log::LoggerInterface, (__gnu_cxx::_Lock_policy)2, false, false&gt;' size-in-bits='8' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='999' column='1' id='type-id-670'>
        <member-type access='public'>
          <typedef-decl name='element_type' type-id='type-id-1338' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1002' column='1' id='type-id-1337'/>
        </member-type>
      </class-decl>
      <class-decl name='__shared_ptr_access&lt;openassetio::v1::managerApi::Host, (__gnu_cxx::_Lock_policy)2, false, false&gt;' size-in-bits='8' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='999' column='1' id='type-id-673'>
        <member-type access='public'>
          <typedef-decl name='element_type' type-id='type-id-1340' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1002' column='1' id='type-id-1339'/>
        </member-type>
      </class-decl>
      <class-decl name='__shared_ptr_access&lt;openassetio::v1::managerApi::HostSession, (__gnu_cxx::_Lock_policy)2, false, false&gt;' size-in-bits='8' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='999' column='1' id='type-id-676'>
        <member-type access='public'>
          <typedef-decl name='element_type' type-id='type-id-416' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1002' column='1' id='type-id-1023'/>
        </member-type>
      </class-decl>
      <class-decl name='__shared_ptr_access&lt;openassetio::v1::managerApi::ManagerInterface, (__gnu_cxx::_Lock_policy)2, false, false&gt;' size-in-bits='8' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='999' column='1' id='type-id-679'>
        <member-type access='public'>
          <typedef-decl name='element_type' type-id='type-id-1342' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr_base.h' line='1002' column='1' id='type-id-1341'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator&lt;char16_t&gt;' size-in-bits='8' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='112' column='1' id='type-id-135'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-91'/>
      </class-decl>
      <class-decl name='allocator&lt;char32_t&gt;' size-in-bits='8' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='112' column='1' id='type-id-138'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-93'/>
      </class-decl>
      <class-decl name='allocator&lt;char&gt;' size-in-bits='8' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='112' column='1' id='type-id-682'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-344'/>
        <member-function access='public' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaIcED4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1029' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaIcED2Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1029' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaIcED4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1029' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='allocator' mangled-name='_ZNSaIcEC4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1029' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='allocator' mangled-name='_ZNSaIcEC2Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1029' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='allocator' mangled-name='_ZNSaIcEC4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1029' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator&lt;std::__detail::_Hash_node&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;, std::variant&lt;bool, long int, double, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;, true&gt; &gt;' size-in-bits='8' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='112' column='1' id='type-id-685'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-346'/>
        <member-type access='public'>
          <class-decl name='rebind&lt;std::__detail::_Hash_node_base*&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='124' column='1' id='type-id-1343'>
            <member-type access='public'>
              <typedef-decl name='other' type-id='type-id-688' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='125' column='1' id='type-id-1344'/>
            </member-type>
          </class-decl>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-499' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='121' column='1' id='type-id-1345'/>
        </member-type>
        <member-function access='public' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaINSt8__detail10_Hash_nodeISt4pairIKSsSt7variantIJbldSsEEELb1EEEED4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1031' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaINSt8__detail10_Hash_nodeISt4pairIKSsSt7variantIJbldSsEEELb1EEEED2Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1031' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='allocator' mangled-name='_ZNSaINSt8__detail10_Hash_nodeISt4pairIKSsSt7variantIJbldSsEEELb1EEEEC4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1031' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='allocator' mangled-name='_ZNSaINSt8__detail10_Hash_nodeISt4pairIKSsSt7variantIJbldSsEEELb1EEEEC2Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1031' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaINSt8__detail10_Hash_nodeISt4pairIKSsSt7variantIJbldSsEEELb1EEEED4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1031' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='allocator' mangled-name='_ZNSaINSt8__detail10_Hash_nodeISt4pairIKSsSt7variantIJbldSsEEELb1EEEEC4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1031' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator&lt;std::__detail::_Hash_node_base*&gt;' size-in-bits='8' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='112' column='1' id='type-id-688'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-348'/>
        <member-function access='public'>
          <function-decl name='allocator&lt;std::__detail::_Hash_node&lt;std::pair&lt;const std::basic_string&lt;char&gt;, std::variant&lt;bool, long int, double, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;, true&gt; &gt;' mangled-name='_ZNSaIPNSt8__detail15_Hash_node_baseEEC4INS_10_Hash_nodeISt4pairIKSsSt7variantIJbldSsEEELb1EEEEERKSaIT_E' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1033' is-artificial='yes'/>
            <parameter type-id='type-id-687'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='allocator&lt;std::__detail::_Hash_node&lt;std::pair&lt;const std::basic_string&lt;char&gt;, std::variant&lt;bool, long int, double, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;, true&gt; &gt;' mangled-name='_ZNSaIPNSt8__detail15_Hash_node_baseEEC2INS_10_Hash_nodeISt4pairIKSsSt7variantIJbldSsEEELb1EEEEERKSaIT_E' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1033' is-artificial='yes'/>
            <parameter type-id='type-id-687'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaIPNSt8__detail15_Hash_node_baseEED4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1033' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaIPNSt8__detail15_Hash_node_baseEED2Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1033' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~allocator' mangled-name='_ZNSaIPNSt8__detail15_Hash_node_baseEED4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1033' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='allocator&lt;std::__detail::_Hash_node&lt;std::pair&lt;const std::basic_string&lt;char&gt;, std::variant&lt;bool, long int, double, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;, true&gt; &gt;' mangled-name='_ZNSaIPNSt8__detail15_Hash_node_baseEEC4INS_10_Hash_nodeISt4pairIKSsSt7variantIJbldSsEEELb1EEEEERKSaIT_E' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1033' is-artificial='yes'/>
            <parameter type-id='type-id-687'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='allocator&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;, std::variant&lt;bool, long int, double, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt; &gt;' size-in-bits='8' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/allocator.h' line='112' column='1' id='type-id-691'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-350'/>
      </class-decl>
      <class-decl name='basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;' size-in-bits='64' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3140' column='1' id='type-id-709'>
        <member-type access='private'>
          <class-decl name='_Alloc_hider' size-in-bits='64' is-struct='yes' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3338' column='1' id='type-id-1046'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-682'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_p' type-id='type-id-9' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3343' column='1'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='_Alloc_hider' mangled-name='_ZNSs12_Alloc_hiderC4EPcRKSaIcE' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3340' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-1048' is-artificial='yes'/>
                <parameter type-id='type-id-9'/>
                <parameter type-id='type-id-684'/>
                <return type-id='type-id-12'/>
              </function-decl>
            </member-function>
            <member-function access='public' constructor='yes'>
              <function-decl name='_Alloc_hider' mangled-name='_ZNSs12_Alloc_hiderC2EPcRKSaIcE' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3340' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-1048' is-artificial='yes'/>
                <parameter type-id='type-id-9'/>
                <parameter type-id='type-id-684'/>
                <return type-id='type-id-12'/>
              </function-decl>
            </member-function>
            <member-function access='public' constructor='yes'>
              <function-decl name='_Alloc_hider' mangled-name='_ZNSs12_Alloc_hiderC4EPcRKSaIcE' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3340' column='1' visibility='default' binding='global' size-in-bits='64'>
                <parameter type-id='type-id-1048' is-artificial='yes'/>
                <parameter type-id='type-id-9'/>
                <parameter type-id='type-id-684'/>
                <return type-id='type-id-12'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Rep' size-in-bits='192' is-struct='yes' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3192' column='1' id='type-id-714'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1346'/>
            <data-member access='public' static='yes'>
              <var-decl name='_S_max_size' type-id='type-id-717' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.tcc' line='490' column='1'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='_S_terminal' type-id='type-id-388' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.tcc' line='495' column='1'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='_S_empty_rep_storage' type-id='type-id-303' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.tcc' line='506' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Rep_base' size-in-bits='192' is-struct='yes' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3185' column='1' id='type-id-1346'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_length' type-id='type-id-302' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3187' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='_M_capacity' type-id='type-id-302' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3188' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='_M_refcount' type-id='type-id-324' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3189' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='__sv_wrapper' size-in-bits='128' is-struct='yes' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3519' column='1' id='type-id-1051'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_sv' type-id='type-id-1347' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3522' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='_If_sv' type-id='type-id-1349' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3504' column='1' id='type-id-1348'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='__sv_type' type-id='type-id-721' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3501' column='1' id='type-id-1347'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='allocator_type' type-id='type-id-682' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3148' column='1' id='type-id-1350'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-338' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3162' column='1' id='type-id-1351'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-720' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3156' column='1' id='type-id-1352'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-341' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3160' column='1' id='type-id-1353'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-1053' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3155' column='1' id='type-id-1354'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-725' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3149' column='1' id='type-id-302'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-731' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3147' column='1' id='type-id-718'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1356' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3163' column='1' id='type-id-1355'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1358' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3163' column='1' id='type-id-1357'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1360' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3163' column='1' id='type-id-1359'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reverse_iterator' type-id='type-id-1362' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3164' column='1' id='type-id-1361'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reverse_iterator' type-id='type-id-1364' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3164' column='1' id='type-id-1363'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reverse_iterator' type-id='type-id-1366' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3164' column='1' id='type-id-1365'/>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='npos' type-id='type-id-717' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3351' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_dataplus' type-id='type-id-1046' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3355' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='operator+=&lt;std::basic_string_view&lt;char&gt; &gt;' mangled-name='_ZNSspLISt17basic_string_viewIcSt11char_traitsIcEEEENSt9enable_ifIXsrSt6__and_IJSt14is_convertibleIRKT_S3_ESt6__not_IS6_IPS8_PKSsEESB_IS6_IS9_PKcEEEE5valueERSsE4typeES9_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='4197' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1045' is-artificial='yes'/>
            <parameter type-id='type-id-723'/>
            <return type-id='type-id-1348'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string&lt;char*&gt;' mangled-name='_ZNSsC4IPcEET_S1_RKSaIcE' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.tcc' line='677' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1045' is-artificial='yes'/>
            <parameter type-id='type-id-9'/>
            <parameter type-id='type-id-9'/>
            <parameter type-id='type-id-684'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string&lt;char*&gt;' mangled-name='_ZNSsC2IPcEET_S1_RKSaIcE' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.tcc' line='677' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1045' is-artificial='yes'/>
            <parameter type-id='type-id-9'/>
            <parameter type-id='type-id-9'/>
            <parameter type-id='type-id-684'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='append&lt;std::basic_string_view&lt;char&gt; &gt;' mangled-name='_ZNSs6appendISt17basic_string_viewIcSt11char_traitsIcEEEENSt9enable_ifIXsrSt6__and_IJSt14is_convertibleIRKT_S3_ESt6__not_IS6_IPS8_PKSsEESB_IS6_IS9_PKcEEEE5valueERSsE4typeES9_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='4289' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1045' is-artificial='yes'/>
            <parameter type-id='type-id-723'/>
            <return type-id='type-id-1348'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct&lt;char*&gt;' mangled-name='_ZNSs12_S_constructIPcEES0_T_S1_RKSaIcE' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='5137' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-9'/>
            <parameter type-id='type-id-9'/>
            <parameter type-id='type-id-684'/>
            <return type-id='type-id-9'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct_aux&lt;char*&gt;' mangled-name='_ZNSs16_S_construct_auxIPcEES0_T_S1_RKSaIcESt12__false_type' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='5115' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-9'/>
            <parameter type-id='type-id-9'/>
            <parameter type-id='type-id-684'/>
            <parameter type-id='type-id-1367'/>
            <return type-id='type-id-9'/>
          </function-decl>
        </member-function>
        <member-function access='private' static='yes'>
          <function-decl name='_S_construct&lt;char*&gt;' mangled-name='_ZNSs12_S_constructIPcEES0_T_S1_RKSaIcESt20forward_iterator_tag' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.tcc' line='563' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-9'/>
            <parameter type-id='type-id-9'/>
            <parameter type-id='type-id-684'/>
            <parameter type-id='type-id-1368'/>
            <return type-id='type-id-9'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~basic_string' mangled-name='_ZNSsD4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3705' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1045' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~basic_string' mangled-name='_ZNSsD2Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3705' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1045' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~basic_string' mangled-name='_ZNSsD4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3705' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1045' is-artificial='yes'/>
            <parameter type-id='type-id-7' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string' mangled-name='_ZNSsC4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3544' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1045' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string' mangled-name='_ZNSsC2Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3544' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1045' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string' mangled-name='_ZNSsC4EOSs' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3628' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1045' is-artificial='yes'/>
            <parameter type-id='type-id-1044'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string' mangled-name='_ZNSsC2EOSs' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3628' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1045' is-artificial='yes'/>
            <parameter type-id='type-id-1044'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='basic_string&lt;char16_t, std::char_traits&lt;char16_t&gt;, std::allocator&lt;char16_t&gt; &gt;' size-in-bits='64' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3140' column='1' id='type-id-143'>
        <member-type access='private'>
          <class-decl name='_Alloc_hider' size-in-bits='64' is-struct='yes' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3338' column='1' id='type-id-256'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-135'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_p' type-id='type-id-96' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3343' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Rep' size-in-bits='192' is-struct='yes' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3192' column='1' id='type-id-147'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1369'/>
            <data-member access='public' static='yes'>
              <var-decl name='_S_max_size' type-id='type-id-717' mangled-name='_ZNSbIDsSt11char_traitsIDsESaIDsEE4_Rep11_S_max_sizeE' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.tcc' line='490' column='1'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='_S_terminal' type-id='type-id-117' mangled-name='_ZNSbIDsSt11char_traitsIDsESaIDsEE4_Rep11_S_terminalE' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.tcc' line='495' column='1'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='_S_empty_rep_storage' type-id='type-id-303' mangled-name='_ZNSbIDsSt11char_traitsIDsESaIDsEE4_Rep20_S_empty_rep_storageE' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.tcc' line='506' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Rep_base' size-in-bits='192' is-struct='yes' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3185' column='1' id='type-id-1369'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_length' type-id='type-id-302' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3187' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='_M_capacity' type-id='type-id-302' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3188' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='_M_refcount' type-id='type-id-324' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3189' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='__sv_wrapper' size-in-bits='128' is-struct='yes' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3519' column='1' id='type-id-260'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_sv' type-id='type-id-1370' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3522' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='__sv_type' type-id='type-id-163' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3501' column='1' id='type-id-1370'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='allocator_type' type-id='type-id-135' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3148' column='1' id='type-id-1371'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-79' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3162' column='1' id='type-id-1372'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-152' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3156' column='1' id='type-id-1373'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-82' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3160' column='1' id='type-id-1374'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-262' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3155' column='1' id='type-id-1375'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-187' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3147' column='1' id='type-id-150'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1377' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3163' column='1' id='type-id-1376'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1379' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3163' column='1' id='type-id-1378'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1381' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3163' column='1' id='type-id-1380'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reverse_iterator' type-id='type-id-1383' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3164' column='1' id='type-id-1382'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reverse_iterator' type-id='type-id-1385' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3164' column='1' id='type-id-1384'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reverse_iterator' type-id='type-id-1387' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3164' column='1' id='type-id-1386'/>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='npos' type-id='type-id-717' mangled-name='_ZNSbIDsSt11char_traitsIDsESaIDsEE4nposE' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3351' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_dataplus' type-id='type-id-256' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3355' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='basic_string&lt;char32_t, std::char_traits&lt;char32_t&gt;, std::allocator&lt;char32_t&gt; &gt;' size-in-bits='64' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3140' column='1' id='type-id-153'>
        <member-type access='private'>
          <class-decl name='_Alloc_hider' size-in-bits='64' is-struct='yes' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3338' column='1' id='type-id-266'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-138'/>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_p' type-id='type-id-100' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3343' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Rep' size-in-bits='192' is-struct='yes' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3192' column='1' id='type-id-157'>
            <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1388'/>
            <data-member access='public' static='yes'>
              <var-decl name='_S_max_size' type-id='type-id-717' mangled-name='_ZNSbIDiSt11char_traitsIDiESaIDiEE4_Rep11_S_max_sizeE' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.tcc' line='490' column='1'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='_S_terminal' type-id='type-id-122' mangled-name='_ZNSbIDiSt11char_traitsIDiESaIDiEE4_Rep11_S_terminalE' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.tcc' line='495' column='1'/>
            </data-member>
            <data-member access='public' static='yes'>
              <var-decl name='_S_empty_rep_storage' type-id='type-id-303' mangled-name='_ZNSbIDiSt11char_traitsIDiESaIDiEE4_Rep20_S_empty_rep_storageE' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.tcc' line='506' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='_Rep_base' size-in-bits='192' is-struct='yes' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3185' column='1' id='type-id-1388'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_length' type-id='type-id-302' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3187' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='_M_capacity' type-id='type-id-302' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3188' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='_M_refcount' type-id='type-id-324' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3189' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='__sv_wrapper' size-in-bits='128' is-struct='yes' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3519' column='1' id='type-id-270'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='_M_sv' type-id='type-id-1389' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3522' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='__sv_type' type-id='type-id-171' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3501' column='1' id='type-id-1389'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='allocator_type' type-id='type-id-138' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3148' column='1' id='type-id-1390'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-85' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3162' column='1' id='type-id-1391'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-162' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3156' column='1' id='type-id-1392'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-88' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3160' column='1' id='type-id-1393'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-272' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3155' column='1' id='type-id-1394'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-194' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3147' column='1' id='type-id-160'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1396' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3163' column='1' id='type-id-1395'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1398' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3163' column='1' id='type-id-1397'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1400' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3163' column='1' id='type-id-1399'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reverse_iterator' type-id='type-id-1402' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3164' column='1' id='type-id-1401'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reverse_iterator' type-id='type-id-1404' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3164' column='1' id='type-id-1403'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reverse_iterator' type-id='type-id-1406' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3164' column='1' id='type-id-1405'/>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='npos' type-id='type-id-717' mangled-name='_ZNSbIDiSt11char_traitsIDiESaIDiEE4nposE' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3351' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_dataplus' type-id='type-id-266' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/basic_string.h' line='3355' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='basic_string_view&lt;char, std::char_traits&lt;char&gt; &gt;' size-in-bits='128' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='90' column='1' id='type-id-721'>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-730' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='105' column='1' id='type-id-1407'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_pointer' type-id='type-id-730' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='102' column='1' id='type-id-1408'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-729' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='104' column='1' id='type-id-1409'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-45' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='100' column='1' id='type-id-727'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1411' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='107' column='1' id='type-id-1410'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1413' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='107' column='1' id='type-id-1412'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1415' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='107' column='1' id='type-id-1414'/>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='npos' type-id='type-id-726' mangled-name='_ZNSt17basic_string_viewIcSt11char_traitsIcEE4nposE' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='111' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_len' type-id='type-id-13' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='456' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_str' type-id='type-id-8' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='457' column='1'/>
        </data-member>
        <member-function access='public' const='yes'>
          <function-decl name='data' mangled-name='_ZNKSt17basic_string_viewIcSt11char_traitsIcEE4dataEv' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='228' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-724' is-artificial='yes'/>
            <return type-id='type-id-1408'/>
          </function-decl>
        </member-function>
        <member-function access='public' const='yes'>
          <function-decl name='size' mangled-name='_ZNKSt17basic_string_viewIcSt11char_traitsIcEE4sizeEv' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-724' is-artificial='yes'/>
            <return type-id='type-id-725'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string_view' mangled-name='_ZNSt17basic_string_viewIcSt11char_traitsIcEEC4EPKc' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1055' is-artificial='yes'/>
            <parameter type-id='type-id-8'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string_view' mangled-name='_ZNSt17basic_string_viewIcSt11char_traitsIcEEC2EPKc' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1055' is-artificial='yes'/>
            <parameter type-id='type-id-8'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string_view' mangled-name='_ZNSt17basic_string_viewIcSt11char_traitsIcEEC4EPKcm' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1055' is-artificial='yes'/>
            <parameter type-id='type-id-8'/>
            <parameter type-id='type-id-725'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string_view' mangled-name='_ZNSt17basic_string_viewIcSt11char_traitsIcEEC2EPKcm' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1055' is-artificial='yes'/>
            <parameter type-id='type-id-8'/>
            <parameter type-id='type-id-725'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='basic_string_view' mangled-name='_ZNSt17basic_string_viewIcSt11char_traitsIcEEC4EPKc' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1055' is-artificial='yes'/>
            <parameter type-id='type-id-8'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='basic_string_view&lt;char16_t, std::char_traits&lt;char16_t&gt; &gt;' size-in-bits='128' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='90' column='1' id='type-id-163'>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-170' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='105' column='1' id='type-id-1416'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_pointer' type-id='type-id-170' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='102' column='1' id='type-id-1417'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-169' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='104' column='1' id='type-id-1418'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-43' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='100' column='1' id='type-id-167'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1420' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='107' column='1' id='type-id-1419'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1422' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='107' column='1' id='type-id-1421'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1424' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='107' column='1' id='type-id-1423'/>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='npos' type-id='type-id-726' mangled-name='_ZNSt17basic_string_viewIDsSt11char_traitsIDsEE4nposE' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='111' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_len' type-id='type-id-13' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='456' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_str' type-id='type-id-119' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='457' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='basic_string_view&lt;char32_t, std::char_traits&lt;char32_t&gt; &gt;' size-in-bits='128' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='90' column='1' id='type-id-171'>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-178' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='105' column='1' id='type-id-1425'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_pointer' type-id='type-id-178' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='102' column='1' id='type-id-1426'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-177' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='104' column='1' id='type-id-1427'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-44' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='100' column='1' id='type-id-175'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1429' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='107' column='1' id='type-id-1428'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1431' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='107' column='1' id='type-id-1430'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1433' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='107' column='1' id='type-id-1432'/>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='npos' type-id='type-id-726' mangled-name='_ZNSt17basic_string_viewIDiSt11char_traitsIDiEE4nposE' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='111' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_len' type-id='type-id-13' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='456' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_str' type-id='type-id-124' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='457' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='basic_string_view&lt;wchar_t, std::char_traits&lt;wchar_t&gt; &gt;' size-in-bits='128' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='90' column='1' id='type-id-179'>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-186' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='105' column='1' id='type-id-1434'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_pointer' type-id='type-id-186' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='102' column='1' id='type-id-1435'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-185' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='104' column='1' id='type-id-1436'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-32' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='100' column='1' id='type-id-183'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1438' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='107' column='1' id='type-id-1437'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1440' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='107' column='1' id='type-id-1439'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1442' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='107' column='1' id='type-id-1441'/>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='npos' type-id='type-id-726' mangled-name='_ZNSt17basic_string_viewIwSt11char_traitsIwEE4nposE' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='111' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_len' type-id='type-id-13' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='456' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_str' type-id='type-id-33' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/string_view' line='457' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='initializer_list&lt;char16_t&gt;' size-in-bits='128' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/initializer_list' line='47' column='1' id='type-id-215'>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-119' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/initializer_list' line='55' column='1' id='type-id-1443'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-119' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/initializer_list' line='54' column='1' id='type-id-1444'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='type-id-1444' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/initializer_list' line='58' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='type-id-725' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/initializer_list' line='59' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='initializer_list&lt;char32_t&gt;' size-in-bits='128' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/initializer_list' line='47' column='1' id='type-id-218'>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-124' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/initializer_list' line='55' column='1' id='type-id-1445'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-124' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/initializer_list' line='54' column='1' id='type-id-1446'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='type-id-1446' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/initializer_list' line='58' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='type-id-725' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/initializer_list' line='59' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='initializer_list&lt;char&gt;' size-in-bits='128' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/initializer_list' line='47' column='1' id='type-id-746'>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-8' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/initializer_list' line='55' column='1' id='type-id-1447'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-8' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/initializer_list' line='54' column='1' id='type-id-1448'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='type-id-1448' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/initializer_list' line='58' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='type-id-725' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/initializer_list' line='59' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='initializer_list&lt;std::pair&lt;const std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;, std::variant&lt;bool, long int, double, std::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt; &gt;' size-in-bits='128' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/initializer_list' line='47' column='1' id='type-id-749'>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-767' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/initializer_list' line='55' column='1' id='type-id-1449'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-767' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/initializer_list' line='54' column='1' id='type-id-1450'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='type-id-1450' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/initializer_list' line='58' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='type-id-725' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/initializer_list' line='59' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='shared_ptr&lt;openassetio::v1::hostApi::Manager&gt;' size-in-bits='128' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr.h' line='103' column='1' id='type-id-774'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-647'/>
        <member-function access='public'>
          <function-decl name='shared_ptr' mangled-name='_ZNSt10shared_ptrIN11openassetio2v17hostApi7ManagerEEC4ERKS4_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1141' is-artificial='yes'/>
            <parameter type-id='type-id-776'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='shared_ptr' mangled-name='_ZNSt10shared_ptrIN11openassetio2v17hostApi7ManagerEEC2ERKS4_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1141' is-artificial='yes'/>
            <parameter type-id='type-id-776'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='shared_ptr' mangled-name='_ZNSt10shared_ptrIN11openassetio2v17hostApi7ManagerEEC4Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1141' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='shared_ptr' mangled-name='_ZNSt10shared_ptrIN11openassetio2v17hostApi7ManagerEEC2Ev' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1141' is-artificial='yes'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='operator=' mangled-name='_ZNSt10shared_ptrIN11openassetio2v17hostApi7ManagerEEaSEOS4_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1141' is-artificial='yes'/>
            <parameter type-id='type-id-1140'/>
            <return type-id='type-id-1139'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='shared_ptr&lt;openassetio::v1::log::LoggerInterface&gt;' size-in-bits='128' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr.h' line='103' column='1' id='type-id-777'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-651'/>
      </class-decl>
      <class-decl name='shared_ptr&lt;openassetio::v1::managerApi::Host&gt;' size-in-bits='128' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr.h' line='103' column='1' id='type-id-780'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-655'/>
      </class-decl>
      <class-decl name='shared_ptr&lt;openassetio::v1::managerApi::HostSession&gt;' size-in-bits='128' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr.h' line='103' column='1' id='type-id-783'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-659'/>
        <member-function access='public'>
          <function-decl name='shared_ptr' mangled-name='_ZNSt10shared_ptrIN11openassetio2v110managerApi11HostSessionEEC4ERKS4_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1150' is-artificial='yes'/>
            <parameter type-id='type-id-785'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='shared_ptr' mangled-name='_ZNSt10shared_ptrIN11openassetio2v110managerApi11HostSessionEEC2ERKS4_' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-1150' is-artificial='yes'/>
            <parameter type-id='type-id-785'/>
            <return type-id='type-id-12'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='shared_ptr&lt;openassetio::v1::managerApi::ManagerInterface&gt;' size-in-bits='128' visibility='default' filepath='/opt/rh/devtoolset-9/root/usr/include/c++/9/bits/shared_ptr.h' line='103' column='1' id='type-id-786'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-663'/>
        <member-function access='public'>
